Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x915 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x8c5f0): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x8cf31): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x8209f): D:/STM32_WORKSPACE/rc_control/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 20 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xb4fe): unsigned int
 <1><38>: Abbrev Number: 6 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x407c7): long long int
 <1><3f>: Abbrev Number: 6 (DW_TAG_base_type)

 <1><4d>: Abbrev Number: 5 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x28e4a): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x1ccc0): unsigned char
 <1><60>: Abbrev Number: 6 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x69eab): short int
 <1><67>: Abbrev Number: 5 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x7474d): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 6 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x88a76): short unsigned int
 <1><7a>: Abbrev Number: 6 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0xba71): long int
 <1><81>: Abbrev Number: 5 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x5a329): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x2b8eb): long unsigned int
 <1><94>: Abbrev Number: 6 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x1d724): long long unsigned int
 <1><9b>: Abbrev Number: 5 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x28e4c): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 5 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x6791d): uint16_t
    <ac>   DW_AT_decl_file   : 3
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 5 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0x671c0): uint32_t
    <b8>   DW_AT_decl_file   : 3
    <b9>   DW_AT_decl_line   : 48
    <ba>   DW_AT_decl_column : 20
    <bb>   DW_AT_type        : <0x81>
 <1><bf>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <c0>   DW_AT_byte_size   : 4
 <1><c1>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x67cad): StackType_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 55
    <c8>   DW_AT_decl_column : 24
    <c9>   DW_AT_type        : <0xb3>
 <1><cd>: Abbrev Number: 5 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x837a1): UBaseType_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 57
    <d4>   DW_AT_decl_column : 23
    <d5>   DW_AT_type        : <0x8d>
 <1><d9>: Abbrev Number: 5 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0x4e735): TickType_t
    <de>   DW_AT_decl_file   : 4
    <df>   DW_AT_decl_line   : 63
    <e0>   DW_AT_decl_column : 19
    <e1>   DW_AT_type        : <0xb3>
 <1><e5>: Abbrev Number: 11 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0x689c8): wint_t
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 359
    <ed>   DW_AT_decl_column : 23
    <ee>   DW_AT_type        : <0x31>
 <1><f2>: Abbrev Number: 5 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x81923): _off_t
    <f7>   DW_AT_decl_file   : 6
    <f8>   DW_AT_decl_line   : 46
    <f9>   DW_AT_decl_column : 14
    <fa>   DW_AT_type        : <0x7a>
 <1><fe>: Abbrev Number: 5 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x1f783): _fpos_t
    <103>   DW_AT_decl_file   : 6
    <104>   DW_AT_decl_line   : 116
    <105>   DW_AT_decl_column : 14
    <106>   DW_AT_type        : <0x7a>
 <1><10a>: Abbrev Number: 22 (DW_TAG_union_type)
    <10b>   DW_AT_byte_size   : 4
    <10c>   DW_AT_decl_file   : 6
    <10d>   DW_AT_decl_line   : 165
    <10e>   DW_AT_decl_column : 3
    <10f>   DW_AT_sibling     : <0x12a>
 <2><113>: Abbrev Number: 15 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x6d110): __wch
    <118>   DW_AT_decl_file   : 6
    <118>   DW_AT_decl_line   : 167
    <119>   DW_AT_decl_column : 12
    <11a>   DW_AT_type        : <0xe5>
 <2><11e>: Abbrev Number: 15 (DW_TAG_member)
    <11f>   DW_AT_name        : (indirect string, offset: 0x491fa): __wchb
    <123>   DW_AT_decl_file   : 6
    <123>   DW_AT_decl_line   : 168
    <124>   DW_AT_decl_column : 19
    <125>   DW_AT_type        : <0x12a>
 <2><129>: Abbrev Number: 0
 <1><12a>: Abbrev Number: 7 (DW_TAG_array_type)
    <12b>   DW_AT_type        : <0x59>
    <12f>   DW_AT_sibling     : <0x13a>
 <2><133>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <134>   DW_AT_type        : <0x31>
    <138>   DW_AT_upper_bound : 3
 <2><139>: Abbrev Number: 0
 <1><13a>: Abbrev Number: 23 (DW_TAG_structure_type)
    <13b>   DW_AT_byte_size   : 8
    <13c>   DW_AT_decl_file   : 6
    <13d>   DW_AT_decl_line   : 162
    <13e>   DW_AT_decl_column : 9
    <13f>   DW_AT_sibling     : <0x15e>
 <2><143>: Abbrev Number: 2 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x27a28): __count
    <148>   DW_AT_decl_file   : 6
    <149>   DW_AT_decl_line   : 164
    <14a>   DW_AT_decl_column : 7
    <14b>   DW_AT_type        : <0x2a>
    <14f>   DW_AT_data_member_location: 0
 <2><150>: Abbrev Number: 2 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x51958): __value
    <155>   DW_AT_decl_file   : 6
    <156>   DW_AT_decl_line   : 169
    <157>   DW_AT_decl_column : 5
    <158>   DW_AT_type        : <0x10a>
    <15c>   DW_AT_data_member_location: 4
 <2><15d>: Abbrev Number: 0
 <1><15e>: Abbrev Number: 5 (DW_TAG_typedef)
    <15f>   DW_AT_name        : (indirect string, offset: 0x4a5a5): _mbstate_t
    <163>   DW_AT_decl_file   : 6
    <164>   DW_AT_decl_line   : 170
    <165>   DW_AT_decl_column : 3
    <166>   DW_AT_type        : <0x13a>
 <1><16a>: Abbrev Number: 5 (DW_TAG_typedef)
    <16b>   DW_AT_name        : (indirect string, offset: 0x4cd84): __ULong
    <16f>   DW_AT_decl_file   : 7
    <170>   DW_AT_decl_line   : 23
    <171>   DW_AT_decl_column : 25
    <172>   DW_AT_type        : <0x8d>
 <1><176>: Abbrev Number: 5 (DW_TAG_typedef)
    <177>   DW_AT_name        : (indirect string, offset: 0x4e36f): _LOCK_T
    <17b>   DW_AT_decl_file   : 8
    <17c>   DW_AT_decl_line   : 34
    <17d>   DW_AT_decl_column : 25
    <17e>   DW_AT_type        : <0x182>
 <1><182>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <183>   DW_AT_byte_size   : 4
    <183>   DW_AT_type        : <0x187>
 <1><187>: Abbrev Number: 16 (DW_TAG_structure_type)
    <188>   DW_AT_name        : (indirect string, offset: 0x2bb1d): __lock
    <18c>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 5 (DW_TAG_typedef)
    <18d>   DW_AT_name        : (indirect string, offset: 0x4618b): _flock_t
    <191>   DW_AT_decl_file   : 7
    <192>   DW_AT_decl_line   : 36
    <193>   DW_AT_decl_column : 27
    <194>   DW_AT_type        : <0x176>
 <1><198>: Abbrev Number: 12 (DW_TAG_structure_type)
    <199>   DW_AT_name        : (indirect string, offset: 0x3115d): _Bigint
    <19d>   DW_AT_byte_size   : 24
    <19e>   DW_AT_decl_file   : 7
    <19e>   DW_AT_decl_line   : 53
    <19f>   DW_AT_decl_column : 8
    <19f>   DW_AT_sibling     : <0x1ee>
 <2><1a3>: Abbrev Number: 2 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x5489e): _next
    <1a8>   DW_AT_decl_file   : 7
    <1a9>   DW_AT_decl_line   : 55
    <1aa>   DW_AT_decl_column : 19
    <1ab>   DW_AT_type        : <0x1ee>
    <1af>   DW_AT_data_member_location: 0
 <2><1b0>: Abbrev Number: 9 (DW_TAG_member)
    <1b1>   DW_AT_name        : _k
    <1b4>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 56
    <1b5>   DW_AT_decl_column : 7
    <1b6>   DW_AT_type        : <0x2a>
    <1ba>   DW_AT_data_member_location: 4
 <2><1bb>: Abbrev Number: 2 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x65900): _maxwds
    <1c0>   DW_AT_decl_file   : 7
    <1c1>   DW_AT_decl_line   : 56
    <1c2>   DW_AT_decl_column : 11
    <1c3>   DW_AT_type        : <0x2a>
    <1c7>   DW_AT_data_member_location: 8
 <2><1c8>: Abbrev Number: 2 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x4b8c8): _sign
    <1cd>   DW_AT_decl_file   : 7
    <1ce>   DW_AT_decl_line   : 56
    <1cf>   DW_AT_decl_column : 20
    <1d0>   DW_AT_type        : <0x2a>
    <1d4>   DW_AT_data_member_location: 12
 <2><1d5>: Abbrev Number: 2 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x4b4db): _wds
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 56
    <1dc>   DW_AT_decl_column : 27
    <1dd>   DW_AT_type        : <0x2a>
    <1e1>   DW_AT_data_member_location: 16
 <2><1e2>: Abbrev Number: 9 (DW_TAG_member)
    <1e3>   DW_AT_name        : _x
    <1e6>   DW_AT_decl_file   : 7
    <1e6>   DW_AT_decl_line   : 57
    <1e7>   DW_AT_decl_column : 11
    <1e8>   DW_AT_type        : <0x1f3>
    <1ec>   DW_AT_data_member_location: 20
 <2><1ed>: Abbrev Number: 0
 <1><1ee>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1ef>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x198>
 <1><1f3>: Abbrev Number: 7 (DW_TAG_array_type)
    <1f4>   DW_AT_type        : <0x16a>
    <1f8>   DW_AT_sibling     : <0x203>
 <2><1fc>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1fd>   DW_AT_type        : <0x31>
    <201>   DW_AT_upper_bound : 0
 <2><202>: Abbrev Number: 0
 <1><203>: Abbrev Number: 12 (DW_TAG_structure_type)
    <204>   DW_AT_name        : (indirect string, offset: 0x268bf): __tm
    <208>   DW_AT_byte_size   : 36
    <209>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 61
    <20a>   DW_AT_decl_column : 8
    <20a>   DW_AT_sibling     : <0x284>
 <2><20e>: Abbrev Number: 2 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x74c66): __tm_sec
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 63
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0x2a>
    <21a>   DW_AT_data_member_location: 0
 <2><21b>: Abbrev Number: 2 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0xa2e): __tm_min
    <220>   DW_AT_decl_file   : 7
    <221>   DW_AT_decl_line   : 64
    <222>   DW_AT_decl_column : 9
    <223>   DW_AT_type        : <0x2a>
    <227>   DW_AT_data_member_location: 4
 <2><228>: Abbrev Number: 2 (DW_TAG_member)
    <229>   DW_AT_name        : (indirect string, offset: 0x1e394): __tm_hour
    <22d>   DW_AT_decl_file   : 7
    <22e>   DW_AT_decl_line   : 65
    <22f>   DW_AT_decl_column : 9
    <230>   DW_AT_type        : <0x2a>
    <234>   DW_AT_data_member_location: 8
 <2><235>: Abbrev Number: 2 (DW_TAG_member)
    <236>   DW_AT_name        : (indirect string, offset: 0x534f5): __tm_mday
    <23a>   DW_AT_decl_file   : 7
    <23b>   DW_AT_decl_line   : 66
    <23c>   DW_AT_decl_column : 9
    <23d>   DW_AT_type        : <0x2a>
    <241>   DW_AT_data_member_location: 12
 <2><242>: Abbrev Number: 2 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x245d): __tm_mon
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 67
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0x2a>
    <24e>   DW_AT_data_member_location: 16
 <2><24f>: Abbrev Number: 2 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x84e22): __tm_year
    <254>   DW_AT_decl_file   : 7
    <255>   DW_AT_decl_line   : 68
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0x2a>
    <25b>   DW_AT_data_member_location: 20
 <2><25c>: Abbrev Number: 2 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0x3b7a5): __tm_wday
    <261>   DW_AT_decl_file   : 7
    <262>   DW_AT_decl_line   : 69
    <263>   DW_AT_decl_column : 9
    <264>   DW_AT_type        : <0x2a>
    <268>   DW_AT_data_member_location: 24
 <2><269>: Abbrev Number: 2 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x710fd): __tm_yday
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 70
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0x2a>
    <275>   DW_AT_data_member_location: 28
 <2><276>: Abbrev Number: 2 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x809b2): __tm_isdst
    <27b>   DW_AT_decl_file   : 7
    <27c>   DW_AT_decl_line   : 71
    <27d>   DW_AT_decl_column : 9
    <27e>   DW_AT_type        : <0x2a>
    <282>   DW_AT_data_member_location: 32
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 12 (DW_TAG_structure_type)
    <285>   DW_AT_name        : (indirect string, offset: 0x5e7fd): __sbuf
    <289>   DW_AT_byte_size   : 8
    <28a>   DW_AT_decl_file   : 7
    <28a>   DW_AT_decl_line   : 116
    <28b>   DW_AT_decl_column : 8
    <28b>   DW_AT_sibling     : <0x2aa>
 <2><28f>: Abbrev Number: 2 (DW_TAG_member)
    <290>   DW_AT_name        : (indirect string, offset: 0x8dd07): _base
    <294>   DW_AT_decl_file   : 7
    <295>   DW_AT_decl_line   : 117
    <296>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x2aa>
    <29b>   DW_AT_data_member_location: 0
 <2><29c>: Abbrev Number: 2 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x515be): _size
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 118
    <2a3>   DW_AT_decl_column : 6
    <2a4>   DW_AT_type        : <0x2a>
    <2a8>   DW_AT_data_member_location: 4
 <2><2a9>: Abbrev Number: 0
 <1><2aa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <2ab>   DW_AT_byte_size   : 4
    <2ab>   DW_AT_type        : <0x59>
 <1><2af>: Abbrev Number: 12 (DW_TAG_structure_type)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x6ce0b): __sFILE
    <2b4>   DW_AT_byte_size   : 104
    <2b5>   DW_AT_decl_file   : 7
    <2b5>   DW_AT_decl_line   : 153
    <2b6>   DW_AT_decl_column : 8
    <2b6>   DW_AT_sibling     : <0x3e8>
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : _p
    <2be>   DW_AT_decl_file   : 7
    <2be>   DW_AT_decl_line   : 154
    <2bf>   DW_AT_decl_column : 18
    <2c0>   DW_AT_type        : <0x2aa>
    <2c4>   DW_AT_data_member_location: 0
 <2><2c5>: Abbrev Number: 9 (DW_TAG_member)
    <2c6>   DW_AT_name        : _r
    <2c9>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 155
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x2a>
    <2cf>   DW_AT_data_member_location: 4
 <2><2d0>: Abbrev Number: 9 (DW_TAG_member)
    <2d1>   DW_AT_name        : _w
    <2d4>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 156
    <2d5>   DW_AT_decl_column : 7
    <2d6>   DW_AT_type        : <0x2a>
    <2da>   DW_AT_data_member_location: 8
 <2><2db>: Abbrev Number: 2 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x4085a): _flags
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 157
    <2e2>   DW_AT_decl_column : 9
    <2e3>   DW_AT_type        : <0x60>
    <2e7>   DW_AT_data_member_location: 12
 <2><2e8>: Abbrev Number: 2 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x15b04): _file
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 158
    <2ef>   DW_AT_decl_column : 9
    <2f0>   DW_AT_type        : <0x60>
    <2f4>   DW_AT_data_member_location: 14
 <2><2f5>: Abbrev Number: 9 (DW_TAG_member)
    <2f6>   DW_AT_name        : _bf
    <2fa>   DW_AT_decl_file   : 7
    <2fa>   DW_AT_decl_line   : 159
    <2fb>   DW_AT_decl_column : 17
    <2fc>   DW_AT_type        : <0x284>
    <300>   DW_AT_data_member_location: 16
 <2><301>: Abbrev Number: 2 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x40ebd): _lbfsize
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 160
    <308>   DW_AT_decl_column : 7
    <309>   DW_AT_type        : <0x2a>
    <30d>   DW_AT_data_member_location: 24
 <2><30e>: Abbrev Number: 2 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x8fc8e): _data
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 163
    <315>   DW_AT_decl_column : 18
    <316>   DW_AT_type        : <0x501>
    <31a>   DW_AT_data_member_location: 28
 <2><31b>: Abbrev Number: 2 (DW_TAG_member)
    <31c>   DW_AT_name        : (indirect string, offset: 0x7f70d): _cookie
    <320>   DW_AT_decl_file   : 7
    <321>   DW_AT_decl_line   : 167
    <322>   DW_AT_decl_column : 10
    <323>   DW_AT_type        : <0xbf>
    <327>   DW_AT_data_member_location: 32
 <2><328>: Abbrev Number: 2 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x7067f): _read
    <32d>   DW_AT_decl_file   : 7
    <32e>   DW_AT_decl_line   : 169
    <32f>   DW_AT_decl_column : 29
    <330>   DW_AT_type        : <0x535>
    <334>   DW_AT_data_member_location: 36
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x11661): _write
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 171
    <33c>   DW_AT_decl_column : 29
    <33d>   DW_AT_type        : <0x55d>
    <341>   DW_AT_data_member_location: 40
 <2><342>: Abbrev Number: 2 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x8c2c1): _seek
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 174
    <349>   DW_AT_decl_column : 13
    <34a>   DW_AT_type        : <0x580>
    <34e>   DW_AT_data_member_location: 44
 <2><34f>: Abbrev Number: 2 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0x3df6a): _close
    <354>   DW_AT_decl_file   : 7
    <355>   DW_AT_decl_line   : 175
    <356>   DW_AT_decl_column : 9
    <357>   DW_AT_type        : <0x599>
    <35b>   DW_AT_data_member_location: 48
 <2><35c>: Abbrev Number: 9 (DW_TAG_member)
    <35d>   DW_AT_name        : _ub
    <361>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 178
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x284>
    <367>   DW_AT_data_member_location: 52
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : _up
    <36d>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 179
    <36e>   DW_AT_decl_column : 18
    <36f>   DW_AT_type        : <0x2aa>
    <373>   DW_AT_data_member_location: 60
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : _ur
    <379>   DW_AT_decl_file   : 7
    <379>   DW_AT_decl_line   : 180
    <37a>   DW_AT_decl_column : 7
    <37b>   DW_AT_type        : <0x2a>
    <37f>   DW_AT_data_member_location: 64
 <2><380>: Abbrev Number: 2 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x264b5): _ubuf
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 183
    <387>   DW_AT_decl_column : 17
    <388>   DW_AT_type        : <0x59e>
    <38c>   DW_AT_data_member_location: 68
 <2><38d>: Abbrev Number: 2 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x604ce): _nbuf
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 184
    <394>   DW_AT_decl_column : 17
    <395>   DW_AT_type        : <0x5ae>
    <399>   DW_AT_data_member_location: 71
 <2><39a>: Abbrev Number: 9 (DW_TAG_member)
    <39b>   DW_AT_name        : _lb
    <39f>   DW_AT_decl_file   : 7
    <39f>   DW_AT_decl_line   : 187
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0x284>
    <3a5>   DW_AT_data_member_location: 72
 <2><3a6>: Abbrev Number: 2 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x23a66): _blksize
    <3ab>   DW_AT_decl_file   : 7
    <3ac>   DW_AT_decl_line   : 190
    <3ad>   DW_AT_decl_column : 7
    <3ae>   DW_AT_type        : <0x2a>
    <3b2>   DW_AT_data_member_location: 80
 <2><3b3>: Abbrev Number: 2 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x2d836): _offset
    <3b8>   DW_AT_decl_file   : 7
    <3b9>   DW_AT_decl_line   : 191
    <3ba>   DW_AT_decl_column : 10
    <3bb>   DW_AT_type        : <0xf2>
    <3bf>   DW_AT_data_member_location: 84
 <2><3c0>: Abbrev Number: 2 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x2bb1e): _lock
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 198
    <3c7>   DW_AT_decl_column : 12
    <3c8>   DW_AT_type        : <0x18c>
    <3cc>   DW_AT_data_member_location: 88
 <2><3cd>: Abbrev Number: 2 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x1005f): _mbstate
    <3d2>   DW_AT_decl_file   : 7
    <3d3>   DW_AT_decl_line   : 200
    <3d4>   DW_AT_decl_column : 14
    <3d5>   DW_AT_type        : <0x15e>
    <3d9>   DW_AT_data_member_location: 92
 <2><3da>: Abbrev Number: 2 (DW_TAG_member)
    <3db>   DW_AT_name        : (indirect string, offset: 0x73f7e): _flags2
    <3df>   DW_AT_decl_file   : 7
    <3e0>   DW_AT_decl_line   : 201
    <3e1>   DW_AT_decl_column : 9
    <3e2>   DW_AT_type        : <0x2a>
    <3e6>   DW_AT_data_member_location: 100
 <2><3e7>: Abbrev Number: 0
 <1><3e8>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x99303): _reent
    <3ed>   DW_AT_byte_size   : 76
    <3ee>   DW_AT_decl_file   : 7
    <3ef>   DW_AT_decl_line   : 379
    <3f1>   DW_AT_decl_column : 8
    <3f2>   DW_AT_sibling     : <0x501>
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x93ccb): _errno
    <3fb>   DW_AT_decl_file   : 7
    <3fc>   DW_AT_decl_line   : 383
    <3fe>   DW_AT_decl_column : 7
    <3ff>   DW_AT_type        : <0x2a>
    <403>   DW_AT_data_member_location: 0
 <2><404>: Abbrev Number: 1 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0x47e84): _stdin
    <409>   DW_AT_decl_file   : 7
    <40a>   DW_AT_decl_line   : 388
    <40c>   DW_AT_decl_column : 11
    <40d>   DW_AT_type        : <0x5cb>
    <411>   DW_AT_data_member_location: 4
 <2><412>: Abbrev Number: 1 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x6173c): _stdout
    <417>   DW_AT_decl_file   : 7
    <418>   DW_AT_decl_line   : 388
    <41a>   DW_AT_decl_column : 20
    <41b>   DW_AT_type        : <0x5cb>
    <41f>   DW_AT_data_member_location: 8
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0x82097): _stderr
    <425>   DW_AT_decl_file   : 7
    <426>   DW_AT_decl_line   : 388
    <428>   DW_AT_decl_column : 30
    <429>   DW_AT_type        : <0x5cb>
    <42d>   DW_AT_data_member_location: 12
 <2><42e>: Abbrev Number: 1 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x59ca4): _inc
    <433>   DW_AT_decl_file   : 7
    <434>   DW_AT_decl_line   : 390
    <436>   DW_AT_decl_column : 8
    <437>   DW_AT_type        : <0x2a>
    <43b>   DW_AT_data_member_location: 16
 <2><43c>: Abbrev Number: 1 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x70d4d): _emergency
    <441>   DW_AT_decl_file   : 7
    <442>   DW_AT_decl_line   : 392
    <444>   DW_AT_decl_column : 9
    <445>   DW_AT_type        : <0x524>
    <449>   DW_AT_data_member_location: 20
 <2><44a>: Abbrev Number: 1 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0x7eb65): _locale
    <44f>   DW_AT_decl_file   : 7
    <450>   DW_AT_decl_line   : 398
    <452>   DW_AT_decl_column : 22
    <453>   DW_AT_type        : <0x731>
    <457>   DW_AT_data_member_location: 24
 <2><458>: Abbrev Number: 24 (DW_TAG_member)
    <459>   DW_AT_name        : _mp
    <45d>   DW_AT_decl_file   : 7
    <45e>   DW_AT_decl_line   : 400
    <460>   DW_AT_decl_column : 18
    <461>   DW_AT_type        : <0x736>
    <465>   DW_AT_data_member_location: 28
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x16202): __cleanup
    <46b>   DW_AT_decl_file   : 7
    <46c>   DW_AT_decl_line   : 402
    <46e>   DW_AT_decl_column : 10
    <46f>   DW_AT_type        : <0x746>
    <473>   DW_AT_data_member_location: 32
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0x97e3): _gamma_signgam
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 404
    <47c>   DW_AT_decl_column : 7
    <47d>   DW_AT_type        : <0x2a>
    <481>   DW_AT_data_member_location: 36
 <2><482>: Abbrev Number: 1 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x6869f): _cvtlen
    <487>   DW_AT_decl_file   : 7
    <488>   DW_AT_decl_line   : 407
    <48a>   DW_AT_decl_column : 7
    <48b>   DW_AT_type        : <0x2a>
    <48f>   DW_AT_data_member_location: 40
 <2><490>: Abbrev Number: 1 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x41721): _cvtbuf
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 408
    <498>   DW_AT_decl_column : 9
    <499>   DW_AT_type        : <0x524>
    <49d>   DW_AT_data_member_location: 44
 <2><49e>: Abbrev Number: 1 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x6a323): _r48
    <4a3>   DW_AT_decl_file   : 7
    <4a4>   DW_AT_decl_line   : 410
    <4a6>   DW_AT_decl_column : 19
    <4a7>   DW_AT_type        : <0x74b>
    <4ab>   DW_AT_data_member_location: 48
 <2><4ac>: Abbrev Number: 1 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x76abd): _localtime_buf
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 411
    <4b4>   DW_AT_decl_column : 16
    <4b5>   DW_AT_type        : <0x750>
    <4b9>   DW_AT_data_member_location: 52
 <2><4ba>: Abbrev Number: 1 (DW_TAG_member)
    <4bb>   DW_AT_name        : (indirect string, offset: 0x215f8): _asctime_buf
    <4bf>   DW_AT_decl_file   : 7
    <4c0>   DW_AT_decl_line   : 412
    <4c2>   DW_AT_decl_column : 9
    <4c3>   DW_AT_type        : <0x524>
    <4c7>   DW_AT_data_member_location: 56
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x6da4): _sig_func
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 415
    <4d0>   DW_AT_decl_column : 12
    <4d1>   DW_AT_type        : <0x760>
    <4d5>   DW_AT_data_member_location: 60
 <2><4d6>: Abbrev Number: 1 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x262b5): __sf
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 423
    <4de>   DW_AT_decl_column : 11
    <4df>   DW_AT_type        : <0x5cb>
    <4e3>   DW_AT_data_member_location: 64
 <2><4e4>: Abbrev Number: 1 (DW_TAG_member)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x3fcf1): _misc
    <4e9>   DW_AT_decl_file   : 7
    <4ea>   DW_AT_decl_line   : 424
    <4ec>   DW_AT_decl_column : 23
    <4ed>   DW_AT_type        : <0x76a>
    <4f1>   DW_AT_data_member_location: 68
 <2><4f2>: Abbrev Number: 1 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x58396): _signal_buf
    <4f7>   DW_AT_decl_file   : 7
    <4f8>   DW_AT_decl_line   : 425
    <4fa>   DW_AT_decl_column : 9
    <4fb>   DW_AT_type        : <0x524>
    <4ff>   DW_AT_data_member_location: 72
 <2><500>: Abbrev Number: 0
 <1><501>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <502>   DW_AT_byte_size   : 4
    <502>   DW_AT_type        : <0x3e8>
 <1><506>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <507>   DW_AT_prototyped  : 1
    <507>   DW_AT_type        : <0x2a>
    <50b>   DW_AT_sibling     : <0x524>
 <2><50f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <510>   DW_AT_type        : <0x501>
 <2><514>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <515>   DW_AT_type        : <0xbf>
 <2><519>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51a>   DW_AT_type        : <0x524>
 <2><51e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51f>   DW_AT_type        : <0x2a>
 <2><523>: Abbrev Number: 0
 <1><524>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <525>   DW_AT_byte_size   : 4
    <525>   DW_AT_type        : <0x529>
 <1><529>: Abbrev Number: 6 (DW_TAG_base_type)
    <52a>   DW_AT_byte_size   : 1
    <52b>   DW_AT_encoding    : 8	(unsigned char)
    <52c>   DW_AT_name        : (indirect string, offset: 0x2db9d): char
 <1><530>: Abbrev Number: 25 (DW_TAG_const_type)
    <531>   DW_AT_type        : <0x529>
 <1><535>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <536>   DW_AT_byte_size   : 4
    <536>   DW_AT_type        : <0x506>
 <1><53a>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <53b>   DW_AT_prototyped  : 1
    <53b>   DW_AT_type        : <0x2a>
    <53f>   DW_AT_sibling     : <0x558>
 <2><543>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <544>   DW_AT_type        : <0x501>
 <2><548>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <549>   DW_AT_type        : <0xbf>
 <2><54d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <54e>   DW_AT_type        : <0x558>
 <2><552>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <553>   DW_AT_type        : <0x2a>
 <2><557>: Abbrev Number: 0
 <1><558>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <559>   DW_AT_byte_size   : 4
    <559>   DW_AT_type        : <0x530>
 <1><55d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <55e>   DW_AT_byte_size   : 4
    <55e>   DW_AT_type        : <0x53a>
 <1><562>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <563>   DW_AT_prototyped  : 1
    <563>   DW_AT_type        : <0xfe>
    <567>   DW_AT_sibling     : <0x580>
 <2><56b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <56c>   DW_AT_type        : <0x501>
 <2><570>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <571>   DW_AT_type        : <0xbf>
 <2><575>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <576>   DW_AT_type        : <0xfe>
 <2><57a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <57b>   DW_AT_type        : <0x2a>
 <2><57f>: Abbrev Number: 0
 <1><580>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <581>   DW_AT_byte_size   : 4
    <581>   DW_AT_type        : <0x562>
 <1><585>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <586>   DW_AT_prototyped  : 1
    <586>   DW_AT_type        : <0x2a>
    <58a>   DW_AT_sibling     : <0x599>
 <2><58e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <58f>   DW_AT_type        : <0x501>
 <2><593>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <594>   DW_AT_type        : <0xbf>
 <2><598>: Abbrev Number: 0
 <1><599>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <59a>   DW_AT_byte_size   : 4
    <59a>   DW_AT_type        : <0x585>
 <1><59e>: Abbrev Number: 7 (DW_TAG_array_type)
    <59f>   DW_AT_type        : <0x59>
    <5a3>   DW_AT_sibling     : <0x5ae>
 <2><5a7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5a8>   DW_AT_type        : <0x31>
    <5ac>   DW_AT_upper_bound : 2
 <2><5ad>: Abbrev Number: 0
 <1><5ae>: Abbrev Number: 7 (DW_TAG_array_type)
    <5af>   DW_AT_type        : <0x59>
    <5b3>   DW_AT_sibling     : <0x5be>
 <2><5b7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5b8>   DW_AT_type        : <0x31>
    <5bc>   DW_AT_upper_bound : 0
 <2><5bd>: Abbrev Number: 0
 <1><5be>: Abbrev Number: 11 (DW_TAG_typedef)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x5a0c6): __FILE
    <5c3>   DW_AT_decl_file   : 7
    <5c4>   DW_AT_decl_line   : 270
    <5c6>   DW_AT_decl_column : 26
    <5c7>   DW_AT_type        : <0x2af>
 <1><5cb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5cc>   DW_AT_byte_size   : 4
    <5cc>   DW_AT_type        : <0x5be>
 <1><5d0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x30ebf): _rand48
    <5d5>   DW_AT_byte_size   : 24
    <5d6>   DW_AT_decl_file   : 7
    <5d7>   DW_AT_decl_line   : 306
    <5d9>   DW_AT_decl_column : 8
    <5da>   DW_AT_sibling     : <0x617>
 <2><5de>: Abbrev Number: 1 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x28ff0): _seed
    <5e3>   DW_AT_decl_file   : 7
    <5e4>   DW_AT_decl_line   : 307
    <5e6>   DW_AT_decl_column : 18
    <5e7>   DW_AT_type        : <0x617>
    <5eb>   DW_AT_data_member_location: 0
 <2><5ec>: Abbrev Number: 1 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xb8ae): _mult
    <5f1>   DW_AT_decl_file   : 7
    <5f2>   DW_AT_decl_line   : 308
    <5f4>   DW_AT_decl_column : 18
    <5f5>   DW_AT_type        : <0x617>
    <5f9>   DW_AT_data_member_location: 6
 <2><5fa>: Abbrev Number: 1 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x492ae): _add
    <5ff>   DW_AT_decl_file   : 7
    <600>   DW_AT_decl_line   : 309
    <602>   DW_AT_decl_column : 18
    <603>   DW_AT_type        : <0x73>
    <607>   DW_AT_data_member_location: 12
 <2><608>: Abbrev Number: 1 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x54899): _rand_next
    <60d>   DW_AT_decl_file   : 7
    <60e>   DW_AT_decl_line   : 312
    <610>   DW_AT_decl_column : 36
    <611>   DW_AT_type        : <0x94>
    <615>   DW_AT_data_member_location: 16
 <2><616>: Abbrev Number: 0
 <1><617>: Abbrev Number: 7 (DW_TAG_array_type)
    <618>   DW_AT_type        : <0x73>
    <61c>   DW_AT_sibling     : <0x627>
 <2><620>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <621>   DW_AT_type        : <0x31>
    <625>   DW_AT_upper_bound : 2
 <2><626>: Abbrev Number: 0
 <1><627>: Abbrev Number: 10 (DW_TAG_structure_type)
    <628>   DW_AT_name        : (indirect string, offset: 0x6c2db): _mprec
    <62c>   DW_AT_byte_size   : 16
    <62d>   DW_AT_decl_file   : 7
    <62e>   DW_AT_decl_line   : 348
    <630>   DW_AT_decl_column : 8
    <631>   DW_AT_sibling     : <0x66e>
 <2><635>: Abbrev Number: 1 (DW_TAG_member)
    <636>   DW_AT_name        : (indirect string, offset: 0x8e4cb): _result
    <63a>   DW_AT_decl_file   : 7
    <63b>   DW_AT_decl_line   : 351
    <63d>   DW_AT_decl_column : 19
    <63e>   DW_AT_type        : <0x1ee>
    <642>   DW_AT_data_member_location: 0
 <2><643>: Abbrev Number: 1 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x6be1e): _result_k
    <648>   DW_AT_decl_file   : 7
    <649>   DW_AT_decl_line   : 352
    <64b>   DW_AT_decl_column : 7
    <64c>   DW_AT_type        : <0x2a>
    <650>   DW_AT_data_member_location: 4
 <2><651>: Abbrev Number: 1 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x43883): _p5s
    <656>   DW_AT_decl_file   : 7
    <657>   DW_AT_decl_line   : 353
    <659>   DW_AT_decl_column : 19
    <65a>   DW_AT_type        : <0x1ee>
    <65e>   DW_AT_data_member_location: 8
 <2><65f>: Abbrev Number: 1 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x5243a): _freelist
    <664>   DW_AT_decl_file   : 7
    <665>   DW_AT_decl_line   : 354
    <667>   DW_AT_decl_column : 20
    <668>   DW_AT_type        : <0x66e>
    <66c>   DW_AT_data_member_location: 12
 <2><66d>: Abbrev Number: 0
 <1><66e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <66f>   DW_AT_byte_size   : 4
    <66f>   DW_AT_type        : <0x1ee>
 <1><673>: Abbrev Number: 10 (DW_TAG_structure_type)
    <674>   DW_AT_name        : (indirect string, offset: 0x43827): _misc_reent
    <678>   DW_AT_byte_size   : 80
    <679>   DW_AT_decl_file   : 7
    <67a>   DW_AT_decl_line   : 358
    <67c>   DW_AT_decl_column : 8
    <67d>   DW_AT_sibling     : <0x71c>
 <2><681>: Abbrev Number: 1 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x82769): _strtok_last
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 361
    <689>   DW_AT_decl_column : 9
    <68a>   DW_AT_type        : <0x524>
    <68e>   DW_AT_data_member_location: 0
 <2><68f>: Abbrev Number: 1 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x3d90c): _mblen_state
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 362
    <697>   DW_AT_decl_column : 14
    <698>   DW_AT_type        : <0x15e>
    <69c>   DW_AT_data_member_location: 4
 <2><69d>: Abbrev Number: 1 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x82798): _wctomb_state
    <6a2>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 363
    <6a5>   DW_AT_decl_column : 14
    <6a6>   DW_AT_type        : <0x15e>
    <6aa>   DW_AT_data_member_location: 12
 <2><6ab>: Abbrev Number: 1 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x79adc): _mbtowc_state
    <6b0>   DW_AT_decl_file   : 7
    <6b1>   DW_AT_decl_line   : 364
    <6b3>   DW_AT_decl_column : 14
    <6b4>   DW_AT_type        : <0x15e>
    <6b8>   DW_AT_data_member_location: 20
 <2><6b9>: Abbrev Number: 1 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x480a5): _l64a_buf
    <6be>   DW_AT_decl_file   : 7
    <6bf>   DW_AT_decl_line   : 365
    <6c1>   DW_AT_decl_column : 8
    <6c2>   DW_AT_type        : <0x71c>
    <6c6>   DW_AT_data_member_location: 28
 <2><6c7>: Abbrev Number: 1 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x81916): _getdate_err
    <6cc>   DW_AT_decl_file   : 7
    <6cd>   DW_AT_decl_line   : 366
    <6cf>   DW_AT_decl_column : 7
    <6d0>   DW_AT_type        : <0x2a>
    <6d4>   DW_AT_data_member_location: 36
 <2><6d5>: Abbrev Number: 1 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x4480a): _mbrlen_state
    <6da>   DW_AT_decl_file   : 7
    <6db>   DW_AT_decl_line   : 367
    <6dd>   DW_AT_decl_column : 14
    <6de>   DW_AT_type        : <0x15e>
    <6e2>   DW_AT_data_member_location: 40
 <2><6e3>: Abbrev Number: 1 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x1efa9): _mbrtowc_state
    <6e8>   DW_AT_decl_file   : 7
    <6e9>   DW_AT_decl_line   : 368
    <6eb>   DW_AT_decl_column : 14
    <6ec>   DW_AT_type        : <0x15e>
    <6f0>   DW_AT_data_member_location: 48
 <2><6f1>: Abbrev Number: 1 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x5dbd2): _mbsrtowcs_state
    <6f6>   DW_AT_decl_file   : 7
    <6f7>   DW_AT_decl_line   : 369
    <6f9>   DW_AT_decl_column : 14
    <6fa>   DW_AT_type        : <0x15e>
    <6fe>   DW_AT_data_member_location: 56
 <2><6ff>: Abbrev Number: 1 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0x2b81f): _wcrtomb_state
    <704>   DW_AT_decl_file   : 7
    <705>   DW_AT_decl_line   : 370
    <707>   DW_AT_decl_column : 14
    <708>   DW_AT_type        : <0x15e>
    <70c>   DW_AT_data_member_location: 64
 <2><70d>: Abbrev Number: 1 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0x50e0b): _wcsrtombs_state
    <712>   DW_AT_decl_file   : 7
    <713>   DW_AT_decl_line   : 371
    <715>   DW_AT_decl_column : 14
    <716>   DW_AT_type        : <0x15e>
    <71a>   DW_AT_data_member_location: 72
 <2><71b>: Abbrev Number: 0
 <1><71c>: Abbrev Number: 7 (DW_TAG_array_type)
    <71d>   DW_AT_type        : <0x529>
    <721>   DW_AT_sibling     : <0x72c>
 <2><725>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <726>   DW_AT_type        : <0x31>
    <72a>   DW_AT_upper_bound : 7
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <72d>   DW_AT_name        : (indirect string, offset: 0x7a457): __locale_t
    <731>   DW_AT_declaration : 1
 <1><731>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <732>   DW_AT_byte_size   : 4
    <732>   DW_AT_type        : <0x72c>
 <1><736>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <737>   DW_AT_byte_size   : 4
    <737>   DW_AT_type        : <0x627>
 <1><73b>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <73c>   DW_AT_prototyped  : 1
    <73c>   DW_AT_sibling     : <0x746>
 <2><740>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <741>   DW_AT_type        : <0x501>
 <2><745>: Abbrev Number: 0
 <1><746>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <747>   DW_AT_byte_size   : 4
    <747>   DW_AT_type        : <0x73b>
 <1><74b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <74c>   DW_AT_byte_size   : 4
    <74c>   DW_AT_type        : <0x5d0>
 <1><750>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <751>   DW_AT_byte_size   : 4
    <751>   DW_AT_type        : <0x203>
 <1><755>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <756>   DW_AT_prototyped  : 1
    <756>   DW_AT_sibling     : <0x760>
 <2><75a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <75b>   DW_AT_type        : <0x2a>
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <761>   DW_AT_byte_size   : 4
    <761>   DW_AT_type        : <0x765>
 <1><765>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <766>   DW_AT_byte_size   : 4
    <766>   DW_AT_type        : <0x755>
 <1><76a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <76b>   DW_AT_byte_size   : 4
    <76b>   DW_AT_type        : <0x673>
 <1><76f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <770>   DW_AT_name        : (indirect string, offset: 0x77458): xSTATIC_LIST_ITEM
    <774>   DW_AT_byte_size   : 20
    <775>   DW_AT_decl_file   : 9
    <776>   DW_AT_decl_line   : 1061
    <778>   DW_AT_decl_column : 8
    <779>   DW_AT_sibling     : <0x79a>
 <2><77d>: Abbrev Number: 1 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x97203): xDummy2
    <782>   DW_AT_decl_file   : 9
    <783>   DW_AT_decl_line   : 1066
    <785>   DW_AT_decl_column : 13
    <786>   DW_AT_type        : <0xd9>
    <78a>   DW_AT_data_member_location: 0
 <2><78b>: Abbrev Number: 1 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x32bc8): pvDummy3
    <790>   DW_AT_decl_file   : 9
    <791>   DW_AT_decl_line   : 1067
    <793>   DW_AT_decl_column : 8
    <794>   DW_AT_type        : <0x79a>
    <798>   DW_AT_data_member_location: 4
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 7 (DW_TAG_array_type)
    <79b>   DW_AT_type        : <0xbf>
    <79f>   DW_AT_sibling     : <0x7aa>
 <2><7a3>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <7a4>   DW_AT_type        : <0x31>
    <7a8>   DW_AT_upper_bound : 3
 <2><7a9>: Abbrev Number: 0
 <1><7aa>: Abbrev Number: 11 (DW_TAG_typedef)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x32e17): StaticListItem_t
    <7af>   DW_AT_decl_file   : 9
    <7b0>   DW_AT_decl_line   : 1072
    <7b2>   DW_AT_decl_column : 34
    <7b3>   DW_AT_type        : <0x76f>
 <1><7b7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7b8>   DW_AT_name        : (indirect string, offset: 0x517a5): xSTATIC_TCB
    <7bc>   DW_AT_byte_size   : 160
    <7bd>   DW_AT_decl_file   : 9
    <7be>   DW_AT_decl_line   : 1112
    <7c0>   DW_AT_decl_column : 16
    <7c1>   DW_AT_sibling     : <0x852>
 <2><7c5>: Abbrev Number: 1 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x1ccce): pxDummy1
    <7ca>   DW_AT_decl_file   : 9
    <7cb>   DW_AT_decl_line   : 1114
    <7cd>   DW_AT_decl_column : 11
    <7ce>   DW_AT_type        : <0xbf>
    <7d2>   DW_AT_data_member_location: 0
 <2><7d3>: Abbrev Number: 1 (DW_TAG_member)
    <7d4>   DW_AT_name        : (indirect string, offset: 0x1b15c): xDummy3
    <7d8>   DW_AT_decl_file   : 9
    <7d9>   DW_AT_decl_line   : 1118
    <7db>   DW_AT_decl_column : 19
    <7dc>   DW_AT_type        : <0x852>
    <7e0>   DW_AT_data_member_location: 4
 <2><7e1>: Abbrev Number: 1 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x137ca): uxDummy5
    <7e6>   DW_AT_decl_file   : 9
    <7e7>   DW_AT_decl_line   : 1119
    <7e9>   DW_AT_decl_column : 16
    <7ea>   DW_AT_type        : <0xcd>
    <7ee>   DW_AT_data_member_location: 44
 <2><7ef>: Abbrev Number: 1 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x1ccf1): pxDummy6
    <7f4>   DW_AT_decl_file   : 9
    <7f5>   DW_AT_decl_line   : 1120
    <7f7>   DW_AT_decl_column : 11
    <7f8>   DW_AT_type        : <0xbf>
    <7fc>   DW_AT_data_member_location: 48
 <2><7fd>: Abbrev Number: 1 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x31c9d): ucDummy7
    <802>   DW_AT_decl_file   : 9
    <803>   DW_AT_decl_line   : 1121
    <805>   DW_AT_decl_column : 13
    <806>   DW_AT_type        : <0x862>
    <80a>   DW_AT_data_member_location: 52
 <2><80b>: Abbrev Number: 1 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x810f7): uxDummy12
    <810>   DW_AT_decl_file   : 9
    <811>   DW_AT_decl_line   : 1132
    <813>   DW_AT_decl_column : 16
    <814>   DW_AT_type        : <0x872>
    <818>   DW_AT_data_member_location: 68
 <2><819>: Abbrev Number: 1 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x71ec3): xDummy17
    <81e>   DW_AT_decl_file   : 9
    <81f>   DW_AT_decl_line   : 1144
    <821>   DW_AT_decl_column : 17
    <822>   DW_AT_type        : <0x3e8>
    <826>   DW_AT_data_member_location: 76
 <2><827>: Abbrev Number: 1 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x147bf): ulDummy18
    <82c>   DW_AT_decl_file   : 9
    <82d>   DW_AT_decl_line   : 1147
    <82f>   DW_AT_decl_column : 14
    <830>   DW_AT_type        : <0xb3>
    <834>   DW_AT_data_member_location: 152
 <2><835>: Abbrev Number: 1 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x8c3fe): ucDummy19
    <83a>   DW_AT_decl_file   : 9
    <83b>   DW_AT_decl_line   : 1148
    <83d>   DW_AT_decl_column : 13
    <83e>   DW_AT_type        : <0x9b>
    <842>   DW_AT_data_member_location: 156
 <2><843>: Abbrev Number: 1 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x81494): uxDummy20
    <848>   DW_AT_decl_file   : 9
    <849>   DW_AT_decl_line   : 1151
    <84b>   DW_AT_decl_column : 13
    <84c>   DW_AT_type        : <0x9b>
    <850>   DW_AT_data_member_location: 157
 <2><851>: Abbrev Number: 0
 <1><852>: Abbrev Number: 7 (DW_TAG_array_type)
    <853>   DW_AT_type        : <0x7aa>
    <857>   DW_AT_sibling     : <0x862>
 <2><85b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <85c>   DW_AT_type        : <0x31>
    <860>   DW_AT_upper_bound : 1
 <2><861>: Abbrev Number: 0
 <1><862>: Abbrev Number: 7 (DW_TAG_array_type)
    <863>   DW_AT_type        : <0x9b>
    <867>   DW_AT_sibling     : <0x872>
 <2><86b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <86c>   DW_AT_type        : <0x31>
    <870>   DW_AT_upper_bound : 15
 <2><871>: Abbrev Number: 0
 <1><872>: Abbrev Number: 7 (DW_TAG_array_type)
    <873>   DW_AT_type        : <0xcd>
    <877>   DW_AT_sibling     : <0x882>
 <2><87b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <87c>   DW_AT_type        : <0x31>
    <880>   DW_AT_upper_bound : 1
 <2><881>: Abbrev Number: 0
 <1><882>: Abbrev Number: 11 (DW_TAG_typedef)
    <883>   DW_AT_name        : (indirect string, offset: 0x46400): StaticTask_t
    <887>   DW_AT_decl_file   : 9
    <888>   DW_AT_decl_line   : 1160
    <88a>   DW_AT_decl_column : 3
    <88b>   DW_AT_type        : <0x7b7>
 <1><88f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <890>   DW_AT_byte_size   : 4
    <890>   DW_AT_type        : <0xc1>
 <1><894>: Abbrev Number: 18 (DW_TAG_variable)
    <895>   DW_AT_name        : (indirect string, offset: 0x4af59): xIdleTaskTCBBuffer
    <899>   DW_AT_decl_file   : 1
    <899>   DW_AT_decl_line   : 59
    <89a>   DW_AT_decl_column : 21
    <89b>   DW_AT_type        : <0x882>
    <89f>   DW_AT_location    : 5 byte block: 3 10 1 0 20 	(DW_OP_addr: 20000110)
 <1><8a5>: Abbrev Number: 7 (DW_TAG_array_type)
    <8a6>   DW_AT_type        : <0xc1>
    <8aa>   DW_AT_sibling     : <0x8b5>
 <2><8ae>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <8af>   DW_AT_type        : <0x31>
    <8b3>   DW_AT_upper_bound : 127
 <2><8b4>: Abbrev Number: 0
 <1><8b5>: Abbrev Number: 18 (DW_TAG_variable)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x34b5f): xIdleStack
    <8ba>   DW_AT_decl_file   : 1
    <8ba>   DW_AT_decl_line   : 60
    <8bb>   DW_AT_decl_column : 20
    <8bc>   DW_AT_type        : <0x8a5>
    <8c0>   DW_AT_location    : 5 byte block: 3 b0 1 0 20 	(DW_OP_addr: 200001b0)
 <1><8c6>: Abbrev Number: 26 (DW_TAG_subprogram)
    <8c7>   DW_AT_external    : 1
    <8c7>   DW_AT_name        : (indirect string, offset: 0xe8cb): vApplicationGetIdleTaskMemory
    <8cb>   DW_AT_decl_file   : 1
    <8cc>   DW_AT_decl_line   : 62
    <8cd>   DW_AT_decl_column : 6
    <8ce>   DW_AT_prototyped  : 1
    <8ce>   DW_AT_low_pc      : 0x80005bc
    <8d2>   DW_AT_high_pc     : 0x34
    <8d6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8d8>   DW_AT_call_all_calls: 1
    <8d8>   DW_AT_sibling     : <0x904>
 <2><8dc>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x4af57): ppxIdleTaskTCBBuffer
    <8e1>   DW_AT_decl_file   : 1
    <8e1>   DW_AT_decl_line   : 62
    <8e1>   DW_AT_decl_column : 52
    <8e2>   DW_AT_type        : <0x904>
    <8e6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8e9>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x5269d): ppxIdleTaskStackBuffer
    <8ee>   DW_AT_decl_file   : 1
    <8ee>   DW_AT_decl_line   : 62
    <8ee>   DW_AT_decl_column : 88
    <8ef>   DW_AT_type        : <0x90e>
    <8f3>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><8f6>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x575d9): pulIdleTaskStackSize
    <8fb>   DW_AT_decl_file   : 1
    <8fb>   DW_AT_decl_line   : 62
    <8fb>   DW_AT_decl_column : 122
    <8fc>   DW_AT_type        : <0x913>
    <900>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><903>: Abbrev Number: 0
 <1><904>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <905>   DW_AT_byte_size   : 4
    <905>   DW_AT_type        : <0x909>
 <1><909>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <90a>   DW_AT_byte_size   : 4
    <90a>   DW_AT_type        : <0x882>
 <1><90e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <90f>   DW_AT_byte_size   : 4
    <90f>   DW_AT_type        : <0x88f>
 <1><913>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <914>   DW_AT_byte_size   : 4
    <914>   DW_AT_type        : <0xb3>
 <1><918>: Abbrev Number: 0
  Compilation Unit @ offset 0x919:
   Length:        0xb46 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x16f
   Pointer Size:  4
 <0><925>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <926>   DW_AT_producer    : (indirect string, offset: 0x8c5f0): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <92a>   DW_AT_language    : 29	(C11)
    <92b>   DW_AT_name        : (indirect string, offset: 0x8f48d): ../Core/Src/lcd_gui.c
    <92f>   DW_AT_comp_dir    : (indirect string, offset: 0x8209f): D:/STM32_WORKSPACE/rc_control/Debug
    <933>   DW_AT_ranges      : 0x1f
    <937>   DW_AT_low_pc      : 0
    <93b>   DW_AT_stmt_list   : 0x9af
    <93f>   DW_AT_macros      : 0x158ce
 <1><943>: Abbrev Number: 6 (DW_TAG_base_type)
    <944>   DW_AT_byte_size   : 1
    <945>   DW_AT_encoding    : 6	(signed char)
    <946>   DW_AT_name        : (indirect string, offset: 0x472c1): signed char
 <1><94a>: Abbrev Number: 4 (DW_TAG_typedef)
    <94b>   DW_AT_name        : (indirect string, offset: 0x28e4a): __uint8_t
    <94f>   DW_AT_decl_file   : 2
    <950>   DW_AT_decl_line   : 43
    <951>   DW_AT_decl_column : 24
    <952>   DW_AT_type        : <0x956>
 <1><956>: Abbrev Number: 6 (DW_TAG_base_type)
    <957>   DW_AT_byte_size   : 1
    <958>   DW_AT_encoding    : 8	(unsigned char)
    <959>   DW_AT_name        : (indirect string, offset: 0x1ccc0): unsigned char
 <1><95d>: Abbrev Number: 6 (DW_TAG_base_type)
    <95e>   DW_AT_byte_size   : 2
    <95f>   DW_AT_encoding    : 5	(signed)
    <960>   DW_AT_name        : (indirect string, offset: 0x69eab): short int
 <1><964>: Abbrev Number: 4 (DW_TAG_typedef)
    <965>   DW_AT_name        : (indirect string, offset: 0x7474d): __uint16_t
    <969>   DW_AT_decl_file   : 2
    <96a>   DW_AT_decl_line   : 57
    <96b>   DW_AT_decl_column : 25
    <96c>   DW_AT_type        : <0x970>
 <1><970>: Abbrev Number: 6 (DW_TAG_base_type)
    <971>   DW_AT_byte_size   : 2
    <972>   DW_AT_encoding    : 7	(unsigned)
    <973>   DW_AT_name        : (indirect string, offset: 0x88a76): short unsigned int
 <1><977>: Abbrev Number: 6 (DW_TAG_base_type)
    <978>   DW_AT_byte_size   : 4
    <979>   DW_AT_encoding    : 5	(signed)
    <97a>   DW_AT_name        : (indirect string, offset: 0xba71): long int
 <1><97e>: Abbrev Number: 4 (DW_TAG_typedef)
    <97f>   DW_AT_name        : (indirect string, offset: 0x5a329): __uint32_t
    <983>   DW_AT_decl_file   : 2
    <984>   DW_AT_decl_line   : 79
    <985>   DW_AT_decl_column : 25
    <986>   DW_AT_type        : <0x98a>
 <1><98a>: Abbrev Number: 6 (DW_TAG_base_type)
    <98b>   DW_AT_byte_size   : 4
    <98c>   DW_AT_encoding    : 7	(unsigned)
    <98d>   DW_AT_name        : (indirect string, offset: 0x2b8eb): long unsigned int
 <1><991>: Abbrev Number: 6 (DW_TAG_base_type)
    <992>   DW_AT_byte_size   : 8
    <993>   DW_AT_encoding    : 5	(signed)
    <994>   DW_AT_name        : (indirect string, offset: 0x407c7): long long int
 <1><998>: Abbrev Number: 6 (DW_TAG_base_type)
    <999>   DW_AT_byte_size   : 8
    <99a>   DW_AT_encoding    : 7	(unsigned)
    <99b>   DW_AT_name        : (indirect string, offset: 0x1d724): long long unsigned int
 <1><99f>: Abbrev Number: 27 (DW_TAG_base_type)
    <9a0>   DW_AT_byte_size   : 4
    <9a1>   DW_AT_encoding    : 5	(signed)
    <9a2>   DW_AT_name        : int
 <1><9a6>: Abbrev Number: 6 (DW_TAG_base_type)
    <9a7>   DW_AT_byte_size   : 4
    <9a8>   DW_AT_encoding    : 7	(unsigned)
    <9a9>   DW_AT_name        : (indirect string, offset: 0xb4fe): unsigned int
 <1><9ad>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ae>   DW_AT_name        : (indirect string, offset: 0x28e4c): uint8_t
    <9b2>   DW_AT_decl_file   : 3
    <9b3>   DW_AT_decl_line   : 24
    <9b4>   DW_AT_decl_column : 19
    <9b5>   DW_AT_type        : <0x94a>
 <1><9b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x6791d): uint16_t
    <9be>   DW_AT_decl_file   : 3
    <9bf>   DW_AT_decl_line   : 36
    <9c0>   DW_AT_decl_column : 20
    <9c1>   DW_AT_type        : <0x964>
 <1><9c5>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <9c6>   DW_AT_type        : <0x9b9>
 <1><9ca>: Abbrev Number: 4 (DW_TAG_typedef)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x671c0): uint32_t
    <9cf>   DW_AT_decl_file   : 3
    <9d0>   DW_AT_decl_line   : 48
    <9d1>   DW_AT_decl_column : 20
    <9d2>   DW_AT_type        : <0x97e>
 <1><9d6>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <9d7>   DW_AT_type        : <0x9ca>
 <1><9db>: Abbrev Number: 13 (DW_TAG_structure_type)
    <9dc>   DW_AT_byte_size   : 24
    <9dd>   DW_AT_decl_file   : 4
    <9de>   DW_AT_decl_line   : 214
    <9df>   DW_AT_decl_column : 9
    <9df>   DW_AT_sibling     : <0xa2b>
 <2><9e3>: Abbrev Number: 17 (DW_TAG_member)
    <9e4>   DW_AT_name        : CR
    <9e7>   DW_AT_decl_file   : 4
    <9e7>   DW_AT_decl_line   : 216
    <9e8>   DW_AT_decl_column : 17
    <9e8>   DW_AT_type        : <0x9d6>
    <9ec>   DW_AT_data_member_location: 0
 <2><9ed>: Abbrev Number: 1 (DW_TAG_member)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x8f78b): NDTR
    <9f2>   DW_AT_decl_file   : 4
    <9f3>   DW_AT_decl_line   : 217
    <9f4>   DW_AT_decl_column : 17
    <9f5>   DW_AT_type        : <0x9d6>
    <9f9>   DW_AT_data_member_location: 4
 <2><9fa>: Abbrev Number: 17 (DW_TAG_member)
    <9fb>   DW_AT_name        : PAR
    <9ff>   DW_AT_decl_file   : 4
    <9ff>   DW_AT_decl_line   : 218
    <a00>   DW_AT_decl_column : 17
    <a00>   DW_AT_type        : <0x9d6>
    <a04>   DW_AT_data_member_location: 8
 <2><a05>: Abbrev Number: 1 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0x8f72f): M0AR
    <a0a>   DW_AT_decl_file   : 4
    <a0b>   DW_AT_decl_line   : 219
    <a0c>   DW_AT_decl_column : 17
    <a0d>   DW_AT_type        : <0x9d6>
    <a11>   DW_AT_data_member_location: 12
 <2><a12>: Abbrev Number: 1 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0x8f435): M1AR
    <a17>   DW_AT_decl_file   : 4
    <a18>   DW_AT_decl_line   : 220
    <a19>   DW_AT_decl_column : 17
    <a1a>   DW_AT_type        : <0x9d6>
    <a1e>   DW_AT_data_member_location: 16
 <2><a1f>: Abbrev Number: 17 (DW_TAG_member)
    <a20>   DW_AT_name        : FCR
    <a24>   DW_AT_decl_file   : 4
    <a24>   DW_AT_decl_line   : 221
    <a25>   DW_AT_decl_column : 17
    <a25>   DW_AT_type        : <0x9d6>
    <a29>   DW_AT_data_member_location: 20
 <2><a2a>: Abbrev Number: 0
 <1><a2b>: Abbrev Number: 4 (DW_TAG_typedef)
    <a2c>   DW_AT_name        : (indirect string, offset: 0x8fa77): DMA_Stream_TypeDef
    <a30>   DW_AT_decl_file   : 4
    <a31>   DW_AT_decl_line   : 222
    <a32>   DW_AT_decl_column : 3
    <a33>   DW_AT_type        : <0x9db>
 <1><a37>: Abbrev Number: 28 (DW_TAG_structure_type)
    <a38>   DW_AT_byte_size   : 40
    <a39>   DW_AT_decl_file   : 4
    <a3a>   DW_AT_decl_line   : 295
    <a3c>   DW_AT_decl_column : 9
    <a3d>   DW_AT_sibling     : <0xab9>
 <2><a41>: Abbrev Number: 11 (DW_TAG_member)
    <a42>   DW_AT_name        : CR1
    <a46>   DW_AT_decl_file   : 4
    <a46>   DW_AT_decl_line   : 297
    <a48>   DW_AT_decl_column : 17
    <a48>   DW_AT_type        : <0x9d6>
    <a4c>   DW_AT_data_member_location: 0
 <2><a4d>: Abbrev Number: 11 (DW_TAG_member)
    <a4e>   DW_AT_name        : CR2
    <a52>   DW_AT_decl_file   : 4
    <a52>   DW_AT_decl_line   : 298
    <a54>   DW_AT_decl_column : 17
    <a54>   DW_AT_type        : <0x9d6>
    <a58>   DW_AT_data_member_location: 4
 <2><a59>: Abbrev Number: 15 (DW_TAG_member)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x8f4a3): OAR1
    <a5e>   DW_AT_decl_file   : 4
    <a5e>   DW_AT_decl_line   : 299
    <a60>   DW_AT_decl_column : 17
    <a60>   DW_AT_type        : <0x9d6>
    <a64>   DW_AT_data_member_location: 8
 <2><a65>: Abbrev Number: 15 (DW_TAG_member)
    <a66>   DW_AT_name        : (indirect string, offset: 0x8f4a8): OAR2
    <a6a>   DW_AT_decl_file   : 4
    <a6a>   DW_AT_decl_line   : 300
    <a6c>   DW_AT_decl_column : 17
    <a6c>   DW_AT_type        : <0x9d6>
    <a70>   DW_AT_data_member_location: 12
 <2><a71>: Abbrev Number: 11 (DW_TAG_member)
    <a72>   DW_AT_name        : DR
    <a75>   DW_AT_decl_file   : 4
    <a75>   DW_AT_decl_line   : 301
    <a77>   DW_AT_decl_column : 17
    <a77>   DW_AT_type        : <0x9d6>
    <a7b>   DW_AT_data_member_location: 16
 <2><a7c>: Abbrev Number: 11 (DW_TAG_member)
    <a7d>   DW_AT_name        : SR1
    <a81>   DW_AT_decl_file   : 4
    <a81>   DW_AT_decl_line   : 302
    <a83>   DW_AT_decl_column : 17
    <a83>   DW_AT_type        : <0x9d6>
    <a87>   DW_AT_data_member_location: 20
 <2><a88>: Abbrev Number: 11 (DW_TAG_member)
    <a89>   DW_AT_name        : SR2
    <a8d>   DW_AT_decl_file   : 4
    <a8d>   DW_AT_decl_line   : 303
    <a8f>   DW_AT_decl_column : 17
    <a8f>   DW_AT_type        : <0x9d6>
    <a93>   DW_AT_data_member_location: 24
 <2><a94>: Abbrev Number: 11 (DW_TAG_member)
    <a95>   DW_AT_name        : CCR
    <a99>   DW_AT_decl_file   : 4
    <a99>   DW_AT_decl_line   : 304
    <a9b>   DW_AT_decl_column : 17
    <a9b>   DW_AT_type        : <0x9d6>
    <a9f>   DW_AT_data_member_location: 28
 <2><aa0>: Abbrev Number: 15 (DW_TAG_member)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x8f7d2): TRISE
    <aa5>   DW_AT_decl_file   : 4
    <aa5>   DW_AT_decl_line   : 305
    <aa7>   DW_AT_decl_column : 17
    <aa7>   DW_AT_type        : <0x9d6>
    <aab>   DW_AT_data_member_location: 32
 <2><aac>: Abbrev Number: 15 (DW_TAG_member)
    <aad>   DW_AT_name        : (indirect string, offset: 0x8f3d6): FLTR
    <ab1>   DW_AT_decl_file   : 4
    <ab1>   DW_AT_decl_line   : 306
    <ab3>   DW_AT_decl_column : 17
    <ab3>   DW_AT_type        : <0x9d6>
    <ab7>   DW_AT_data_member_location: 36
 <2><ab8>: Abbrev Number: 0
 <1><ab9>: Abbrev Number: 29 (DW_TAG_typedef)
    <aba>   DW_AT_name        : (indirect string, offset: 0x8f99d): I2C_TypeDef
    <abe>   DW_AT_decl_file   : 4
    <abf>   DW_AT_decl_line   : 307
    <ac1>   DW_AT_decl_column : 3
    <ac2>   DW_AT_type        : <0xa37>
 <1><ac6>: Abbrev Number: 6 (DW_TAG_base_type)
    <ac7>   DW_AT_byte_size   : 8
    <ac8>   DW_AT_encoding    : 4	(float)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x75178): long double
 <1><acd>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <ace>   DW_AT_encoding    : 7	(unsigned)
    <ace>   DW_AT_byte_size   : 1
    <ace>   DW_AT_type        : <0x956>
    <ad2>   DW_AT_decl_file   : 5
    <ad3>   DW_AT_decl_line   : 50
    <ad4>   DW_AT_decl_column : 1
    <ad4>   DW_AT_sibling     : <0xae5>
 <2><ad8>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x8f8fa): HAL_UNLOCKED
    <add>   DW_AT_const_value : 0
 <2><ade>: Abbrev Number: 2 (DW_TAG_enumerator)
    <adf>   DW_AT_name        : (indirect string, offset: 0x8fb93): HAL_LOCKED
    <ae3>   DW_AT_const_value : 1
 <2><ae4>: Abbrev Number: 0
 <1><ae5>: Abbrev Number: 4 (DW_TAG_typedef)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x8f856): HAL_LockTypeDef
    <aea>   DW_AT_decl_file   : 5
    <aeb>   DW_AT_decl_line   : 53
    <aec>   DW_AT_decl_column : 3
    <aed>   DW_AT_type        : <0xacd>
 <1><af1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <af2>   DW_AT_byte_size   : 48
    <af3>   DW_AT_decl_file   : 6
    <af4>   DW_AT_decl_line   : 48
    <af5>   DW_AT_decl_column : 9
    <af5>   DW_AT_sibling     : <0xb96>
 <2><af9>: Abbrev Number: 1 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x916e5): Channel
    <afe>   DW_AT_decl_file   : 6
    <aff>   DW_AT_decl_line   : 50
    <b00>   DW_AT_decl_column : 12
    <b01>   DW_AT_type        : <0x9ca>
    <b05>   DW_AT_data_member_location: 0
 <2><b06>: Abbrev Number: 1 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0x95559): Direction
    <b0b>   DW_AT_decl_file   : 6
    <b0c>   DW_AT_decl_line   : 53
    <b0d>   DW_AT_decl_column : 12
    <b0e>   DW_AT_type        : <0x9ca>
    <b12>   DW_AT_data_member_location: 4
 <2><b13>: Abbrev Number: 1 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0x8f416): PeriphInc
    <b18>   DW_AT_decl_file   : 6
    <b19>   DW_AT_decl_line   : 57
    <b1a>   DW_AT_decl_column : 12
    <b1b>   DW_AT_type        : <0x9ca>
    <b1f>   DW_AT_data_member_location: 8
 <2><b20>: Abbrev Number: 1 (DW_TAG_member)
    <b21>   DW_AT_name        : (indirect string, offset: 0x8f4ad): MemInc
    <b25>   DW_AT_decl_file   : 6
    <b26>   DW_AT_decl_line   : 60
    <b27>   DW_AT_decl_column : 12
    <b28>   DW_AT_type        : <0x9ca>
    <b2c>   DW_AT_data_member_location: 12
 <2><b2d>: Abbrev Number: 1 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x8f79f): PeriphDataAlignment
    <b32>   DW_AT_decl_file   : 6
    <b33>   DW_AT_decl_line   : 63
    <b34>   DW_AT_decl_column : 12
    <b35>   DW_AT_type        : <0x9ca>
    <b39>   DW_AT_data_member_location: 16
 <2><b3a>: Abbrev Number: 1 (DW_TAG_member)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x8fa47): MemDataAlignment
    <b3f>   DW_AT_decl_file   : 6
    <b40>   DW_AT_decl_line   : 66
    <b41>   DW_AT_decl_column : 12
    <b42>   DW_AT_type        : <0x9ca>
    <b46>   DW_AT_data_member_location: 20
 <2><b47>: Abbrev Number: 1 (DW_TAG_member)
    <b48>   DW_AT_name        : (indirect string, offset: 0x95e6b): Mode
    <b4c>   DW_AT_decl_file   : 6
    <b4d>   DW_AT_decl_line   : 69
    <b4e>   DW_AT_decl_column : 12
    <b4f>   DW_AT_type        : <0x9ca>
    <b53>   DW_AT_data_member_location: 24
 <2><b54>: Abbrev Number: 1 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0x947b6): Priority
    <b59>   DW_AT_decl_file   : 6
    <b5a>   DW_AT_decl_line   : 74
    <b5b>   DW_AT_decl_column : 12
    <b5c>   DW_AT_type        : <0x9ca>
    <b60>   DW_AT_data_member_location: 28
 <2><b61>: Abbrev Number: 1 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0x8f743): FIFOMode
    <b66>   DW_AT_decl_file   : 6
    <b67>   DW_AT_decl_line   : 77
    <b68>   DW_AT_decl_column : 12
    <b69>   DW_AT_type        : <0x9ca>
    <b6d>   DW_AT_data_member_location: 32
 <2><b6e>: Abbrev Number: 1 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x8f939): FIFOThreshold
    <b73>   DW_AT_decl_file   : 6
    <b74>   DW_AT_decl_line   : 82
    <b75>   DW_AT_decl_column : 12
    <b76>   DW_AT_type        : <0x9ca>
    <b7a>   DW_AT_data_member_location: 36
 <2><b7b>: Abbrev Number: 1 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x8f6f8): MemBurst
    <b80>   DW_AT_decl_file   : 6
    <b81>   DW_AT_decl_line   : 85
    <b82>   DW_AT_decl_column : 12
    <b83>   DW_AT_type        : <0x9ca>
    <b87>   DW_AT_data_member_location: 40
 <2><b88>: Abbrev Number: 1 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0x8f68d): PeriphBurst
    <b8d>   DW_AT_decl_file   : 6
    <b8e>   DW_AT_decl_line   : 91
    <b8f>   DW_AT_decl_column : 12
    <b90>   DW_AT_type        : <0x9ca>
    <b94>   DW_AT_data_member_location: 44
 <2><b95>: Abbrev Number: 0
 <1><b96>: Abbrev Number: 4 (DW_TAG_typedef)
    <b97>   DW_AT_name        : (indirect string, offset: 0x8f59a): DMA_InitTypeDef
    <b9b>   DW_AT_decl_file   : 6
    <b9c>   DW_AT_decl_line   : 96
    <b9d>   DW_AT_decl_column : 2
    <b9e>   DW_AT_type        : <0xaf1>
 <1><ba2>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <ba3>   DW_AT_encoding    : 7	(unsigned)
    <ba3>   DW_AT_byte_size   : 1
    <ba3>   DW_AT_type        : <0x956>
    <ba7>   DW_AT_decl_file   : 6
    <ba8>   DW_AT_decl_line   : 103
    <ba9>   DW_AT_decl_column : 1
    <ba9>   DW_AT_sibling     : <0xbd2>
 <2><bad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bae>   DW_AT_name        : (indirect string, offset: 0x8f907): HAL_DMA_STATE_RESET
    <bb2>   DW_AT_const_value : 0
 <2><bb3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x8f5bf): HAL_DMA_STATE_READY
    <bb8>   DW_AT_const_value : 1
 <2><bb9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bba>   DW_AT_name        : (indirect string, offset: 0x8f8b4): HAL_DMA_STATE_BUSY
    <bbe>   DW_AT_const_value : 2
 <2><bbf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x8fb5c): HAL_DMA_STATE_TIMEOUT
    <bc4>   DW_AT_const_value : 3
 <2><bc5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x8fa22): HAL_DMA_STATE_ERROR
    <bca>   DW_AT_const_value : 4
 <2><bcb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x8f4f4): HAL_DMA_STATE_ABORT
    <bd0>   DW_AT_const_value : 5
 <2><bd1>: Abbrev Number: 0
 <1><bd2>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x8f7e9): HAL_DMA_StateTypeDef
    <bd7>   DW_AT_decl_file   : 6
    <bd8>   DW_AT_decl_line   : 110
    <bd9>   DW_AT_decl_column : 2
    <bda>   DW_AT_type        : <0xba2>
 <1><bde>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <bdf>   DW_AT_type        : <0xbd2>
 <1><be3>: Abbrev Number: 20 (DW_TAG_structure_type)
    <be4>   DW_AT_name        : (indirect string, offset: 0x8fa03): __DMA_HandleTypeDef
    <be8>   DW_AT_byte_size   : 96
    <be9>   DW_AT_decl_file   : 6
    <bea>   DW_AT_decl_line   : 138
    <beb>   DW_AT_decl_column : 16
    <beb>   DW_AT_sibling     : <0xca6>
 <2><bef>: Abbrev Number: 1 (DW_TAG_member)
    <bf0>   DW_AT_name        : (indirect string, offset: 0x8f6da): Instance
    <bf4>   DW_AT_decl_file   : 6
    <bf5>   DW_AT_decl_line   : 140
    <bf6>   DW_AT_decl_column : 31
    <bf7>   DW_AT_type        : <0xca6>
    <bfb>   DW_AT_data_member_location: 0
 <2><bfc>: Abbrev Number: 1 (DW_TAG_member)
    <bfd>   DW_AT_name        : (indirect string, offset: 0x9290c): Init
    <c01>   DW_AT_decl_file   : 6
    <c02>   DW_AT_decl_line   : 142
    <c03>   DW_AT_decl_column : 30
    <c04>   DW_AT_type        : <0xb96>
    <c08>   DW_AT_data_member_location: 4
 <2><c09>: Abbrev Number: 1 (DW_TAG_member)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x65097): Lock
    <c0e>   DW_AT_decl_file   : 6
    <c0f>   DW_AT_decl_line   : 144
    <c10>   DW_AT_decl_column : 30
    <c11>   DW_AT_type        : <0xae5>
    <c15>   DW_AT_data_member_location: 52
 <2><c16>: Abbrev Number: 1 (DW_TAG_member)
    <c17>   DW_AT_name        : (indirect string, offset: 0x921a1): State
    <c1b>   DW_AT_decl_file   : 6
    <c1c>   DW_AT_decl_line   : 146
    <c1d>   DW_AT_decl_column : 30
    <c1e>   DW_AT_type        : <0xbde>
    <c22>   DW_AT_data_member_location: 53
 <2><c23>: Abbrev Number: 1 (DW_TAG_member)
    <c24>   DW_AT_name        : (indirect string, offset: 0x8fae0): Parent
    <c28>   DW_AT_decl_file   : 6
    <c29>   DW_AT_decl_line   : 148
    <c2a>   DW_AT_decl_column : 31
    <c2b>   DW_AT_type        : <0xcab>
    <c2f>   DW_AT_data_member_location: 56
 <2><c30>: Abbrev Number: 1 (DW_TAG_member)
    <c31>   DW_AT_name        : (indirect string, offset: 0x8fb82): XferCpltCallback
    <c35>   DW_AT_decl_file   : 6
    <c36>   DW_AT_decl_line   : 150
    <c37>   DW_AT_decl_column : 33
    <c38>   DW_AT_type        : <0xcbd>
    <c3c>   DW_AT_data_member_location: 60
 <2><c3d>: Abbrev Number: 1 (DW_TAG_member)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x8f977): XferHalfCpltCallback
    <c42>   DW_AT_decl_file   : 6
    <c43>   DW_AT_decl_line   : 152
    <c44>   DW_AT_decl_column : 33
    <c45>   DW_AT_type        : <0xcbd>
    <c49>   DW_AT_data_member_location: 64
 <2><c4a>: Abbrev Number: 1 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x8f508): XferM1CpltCallback
    <c4f>   DW_AT_decl_file   : 6
    <c50>   DW_AT_decl_line   : 154
    <c51>   DW_AT_decl_column : 33
    <c52>   DW_AT_type        : <0xcbd>
    <c56>   DW_AT_data_member_location: 68
 <2><c57>: Abbrev Number: 1 (DW_TAG_member)
    <c58>   DW_AT_name        : (indirect string, offset: 0x8f7fe): XferM1HalfCpltCallback
    <c5c>   DW_AT_decl_file   : 6
    <c5d>   DW_AT_decl_line   : 156
    <c5e>   DW_AT_decl_column : 33
    <c5f>   DW_AT_type        : <0xcbd>
    <c63>   DW_AT_data_member_location: 72
 <2><c64>: Abbrev Number: 1 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0x8f473): XferErrorCallback
    <c69>   DW_AT_decl_file   : 6
    <c6a>   DW_AT_decl_line   : 158
    <c6b>   DW_AT_decl_column : 33
    <c6c>   DW_AT_type        : <0xcbd>
    <c70>   DW_AT_data_member_location: 76
 <2><c71>: Abbrev Number: 1 (DW_TAG_member)
    <c72>   DW_AT_name        : (indirect string, offset: 0x8fab6): XferAbortCallback
    <c76>   DW_AT_decl_file   : 6
    <c77>   DW_AT_decl_line   : 160
    <c78>   DW_AT_decl_column : 33
    <c79>   DW_AT_type        : <0xcbd>
    <c7d>   DW_AT_data_member_location: 80
 <2><c7e>: Abbrev Number: 1 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x8fb0e): ErrorCode
    <c83>   DW_AT_decl_file   : 6
    <c84>   DW_AT_decl_line   : 162
    <c85>   DW_AT_decl_column : 30
    <c86>   DW_AT_type        : <0x9d6>
    <c8a>   DW_AT_data_member_location: 84
 <2><c8b>: Abbrev Number: 1 (DW_TAG_member)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x8f927): StreamBaseAddress
    <c90>   DW_AT_decl_file   : 6
    <c91>   DW_AT_decl_line   : 164
    <c92>   DW_AT_decl_column : 30
    <c93>   DW_AT_type        : <0x9ca>
    <c97>   DW_AT_data_member_location: 88
 <2><c98>: Abbrev Number: 1 (DW_TAG_member)
    <c99>   DW_AT_name        : (indirect string, offset: 0x8f9f7): StreamIndex
    <c9d>   DW_AT_decl_file   : 6
    <c9e>   DW_AT_decl_line   : 166
    <c9f>   DW_AT_decl_column : 30
    <ca0>   DW_AT_type        : <0x9ca>
    <ca4>   DW_AT_data_member_location: 92
 <2><ca5>: Abbrev Number: 0
 <1><ca6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca7>   DW_AT_byte_size   : 4
    <ca7>   DW_AT_type        : <0xa2b>
 <1><cab>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <cac>   DW_AT_byte_size   : 4
 <1><cad>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <cae>   DW_AT_prototyped  : 1
    <cae>   DW_AT_sibling     : <0xcb8>
 <2><cb2>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cb3>   DW_AT_type        : <0xcb8>
 <2><cb7>: Abbrev Number: 0
 <1><cb8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cb9>   DW_AT_byte_size   : 4
    <cb9>   DW_AT_type        : <0xbe3>
 <1><cbd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cbe>   DW_AT_byte_size   : 4
    <cbe>   DW_AT_type        : <0xcad>
 <1><cc2>: Abbrev Number: 4 (DW_TAG_typedef)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x8fa05): DMA_HandleTypeDef
    <cc7>   DW_AT_decl_file   : 6
    <cc8>   DW_AT_decl_line   : 168
    <cc9>   DW_AT_decl_column : 2
    <cca>   DW_AT_type        : <0xbe3>
 <1><cce>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ccf>   DW_AT_byte_size   : 32
    <cd0>   DW_AT_decl_file   : 7
    <cd1>   DW_AT_decl_line   : 47
    <cd2>   DW_AT_decl_column : 9
    <cd2>   DW_AT_sibling     : <0xd3f>
 <2><cd6>: Abbrev Number: 1 (DW_TAG_member)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x8f63d): ClockSpeed
    <cdb>   DW_AT_decl_file   : 7
    <cdc>   DW_AT_decl_line   : 49
    <cdd>   DW_AT_decl_column : 12
    <cde>   DW_AT_type        : <0x9ca>
    <ce2>   DW_AT_data_member_location: 0
 <2><ce3>: Abbrev Number: 1 (DW_TAG_member)
    <ce4>   DW_AT_name        : (indirect string, offset: 0x8f84c): DutyCycle
    <ce8>   DW_AT_decl_file   : 7
    <ce9>   DW_AT_decl_line   : 52
    <cea>   DW_AT_decl_column : 12
    <ceb>   DW_AT_type        : <0x9ca>
    <cef>   DW_AT_data_member_location: 4
 <2><cf0>: Abbrev Number: 1 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x8f6bc): OwnAddress1
    <cf5>   DW_AT_decl_file   : 7
    <cf6>   DW_AT_decl_line   : 55
    <cf7>   DW_AT_decl_column : 12
    <cf8>   DW_AT_type        : <0x9ca>
    <cfc>   DW_AT_data_member_location: 8
 <2><cfd>: Abbrev Number: 1 (DW_TAG_member)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x8f734): AddressingMode
    <d02>   DW_AT_decl_file   : 7
    <d03>   DW_AT_decl_line   : 58
    <d04>   DW_AT_decl_column : 12
    <d05>   DW_AT_type        : <0x9ca>
    <d09>   DW_AT_data_member_location: 12
 <2><d0a>: Abbrev Number: 1 (DW_TAG_member)
    <d0b>   DW_AT_name        : (indirect string, offset: 0x8f8cd): DualAddressMode
    <d0f>   DW_AT_decl_file   : 7
    <d10>   DW_AT_decl_line   : 61
    <d11>   DW_AT_decl_column : 12
    <d12>   DW_AT_type        : <0x9ca>
    <d16>   DW_AT_data_member_location: 16
 <2><d17>: Abbrev Number: 1 (DW_TAG_member)
    <d18>   DW_AT_name        : (indirect string, offset: 0x8f6c8): OwnAddress2
    <d1c>   DW_AT_decl_file   : 7
    <d1d>   DW_AT_decl_line   : 64
    <d1e>   DW_AT_decl_column : 12
    <d1f>   DW_AT_type        : <0x9ca>
    <d23>   DW_AT_data_member_location: 20
 <2><d24>: Abbrev Number: 1 (DW_TAG_member)
    <d25>   DW_AT_name        : (indirect string, offset: 0x8f4b4): GeneralCallMode
    <d29>   DW_AT_decl_file   : 7
    <d2a>   DW_AT_decl_line   : 67
    <d2b>   DW_AT_decl_column : 12
    <d2c>   DW_AT_type        : <0x9ca>
    <d30>   DW_AT_data_member_location: 24
 <2><d31>: Abbrev Number: 1 (DW_TAG_member)
    <d32>   DW_AT_name        : (indirect string, offset: 0x8f60e): NoStretchMode
    <d36>   DW_AT_decl_file   : 7
    <d37>   DW_AT_decl_line   : 70
    <d38>   DW_AT_decl_column : 12
    <d39>   DW_AT_type        : <0x9ca>
    <d3d>   DW_AT_data_member_location: 28
 <2><d3e>: Abbrev Number: 0
 <1><d3f>: Abbrev Number: 4 (DW_TAG_typedef)
    <d40>   DW_AT_name        : (indirect string, offset: 0x8f62d): I2C_InitTypeDef
    <d44>   DW_AT_decl_file   : 7
    <d45>   DW_AT_decl_line   : 73
    <d46>   DW_AT_decl_column : 3
    <d47>   DW_AT_type        : <0xcce>
 <1><d4b>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d4c>   DW_AT_encoding    : 7	(unsigned)
    <d4c>   DW_AT_byte_size   : 1
    <d4c>   DW_AT_type        : <0x956>
    <d50>   DW_AT_decl_file   : 7
    <d51>   DW_AT_decl_line   : 107
    <d52>   DW_AT_decl_column : 1
    <d52>   DW_AT_sibling     : <0xd99>
 <2><d56>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d57>   DW_AT_name        : (indirect string, offset: 0x8f9b2): HAL_I2C_STATE_RESET
    <d5b>   DW_AT_const_value : 0
 <2><d5c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d5d>   DW_AT_name        : (indirect string, offset: 0x8f659): HAL_I2C_STATE_READY
    <d61>   DW_AT_const_value : 32
 <2><d62>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d63>   DW_AT_name        : (indirect string, offset: 0x8f5fb): HAL_I2C_STATE_BUSY
    <d67>   DW_AT_const_value : 36
 <2><d68>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d69>   DW_AT_name        : (indirect string, offset: 0x8f893): HAL_I2C_STATE_BUSY_TX
    <d6d>   DW_AT_const_value : 33
 <2><d6e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x8f6a6): HAL_I2C_STATE_BUSY_RX
    <d73>   DW_AT_const_value : 34
 <2><d74>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d75>   DW_AT_name        : (indirect string, offset: 0x8f6e3): HAL_I2C_STATE_LISTEN
    <d79>   DW_AT_const_value : 40
 <2><d7a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d7b>   DW_AT_name        : (indirect string, offset: 0x8f51b): HAL_I2C_STATE_BUSY_TX_LISTEN
    <d7f>   DW_AT_const_value : 41
 <2><d80>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d81>   DW_AT_name        : (indirect string, offset: 0x8f947): HAL_I2C_STATE_BUSY_RX_LISTEN
    <d85>   DW_AT_const_value : 42
 <2><d86>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d87>   DW_AT_name        : (indirect string, offset: 0x8f5d3): HAL_I2C_STATE_ABORT
    <d8b>   DW_AT_const_value : 96
 <2><d8c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x8f9e1): HAL_I2C_STATE_TIMEOUT
    <d91>   DW_AT_const_value : 160
 <2><d92>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d93>   DW_AT_name        : (indirect string, offset: 0x8fa63): HAL_I2C_STATE_ERROR
    <d97>   DW_AT_const_value : 224
 <2><d98>: Abbrev Number: 0
 <1><d99>: Abbrev Number: 4 (DW_TAG_typedef)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x8f4c9): HAL_I2C_StateTypeDef
    <d9e>   DW_AT_decl_file   : 7
    <d9f>   DW_AT_decl_line   : 122
    <da0>   DW_AT_decl_column : 3
    <da1>   DW_AT_type        : <0xd4b>
 <1><da5>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <da6>   DW_AT_type        : <0xd99>
 <1><daa>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <dab>   DW_AT_encoding    : 7	(unsigned)
    <dab>   DW_AT_byte_size   : 1
    <dab>   DW_AT_type        : <0x956>
    <daf>   DW_AT_decl_file   : 7
    <db0>   DW_AT_decl_line   : 147
    <db1>   DW_AT_decl_column : 1
    <db1>   DW_AT_sibling     : <0xdce>
 <2><db5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0x8f578): HAL_I2C_MODE_NONE
    <dba>   DW_AT_const_value : 0
 <2><dbb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x8f3e6): HAL_I2C_MODE_MASTER
    <dc0>   DW_AT_const_value : 16
 <2><dc1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x8f7b3): HAL_I2C_MODE_SLAVE
    <dc6>   DW_AT_const_value : 32
 <2><dc7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x8f61c): HAL_I2C_MODE_MEM
    <dcc>   DW_AT_const_value : 64
 <2><dcd>: Abbrev Number: 0
 <1><dce>: Abbrev Number: 4 (DW_TAG_typedef)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x8f777): HAL_I2C_ModeTypeDef
    <dd3>   DW_AT_decl_file   : 7
    <dd4>   DW_AT_decl_line   : 153
    <dd5>   DW_AT_decl_column : 3
    <dd6>   DW_AT_type        : <0xdaa>
 <1><dda>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ddb>   DW_AT_type        : <0xdce>
 <1><ddf>: Abbrev Number: 13 (DW_TAG_structure_type)
    <de0>   DW_AT_byte_size   : 84
    <de1>   DW_AT_decl_file   : 7
    <de2>   DW_AT_decl_line   : 187
    <de3>   DW_AT_decl_column : 9
    <de3>   DW_AT_sibling     : <0xec5>
 <2><de7>: Abbrev Number: 1 (DW_TAG_member)
    <de8>   DW_AT_name        : (indirect string, offset: 0x8f6da): Instance
    <dec>   DW_AT_decl_file   : 7
    <ded>   DW_AT_decl_line   : 190
    <dee>   DW_AT_decl_column : 31
    <def>   DW_AT_type        : <0xec5>
    <df3>   DW_AT_data_member_location: 0
 <2><df4>: Abbrev Number: 1 (DW_TAG_member)
    <df5>   DW_AT_name        : (indirect string, offset: 0x9290c): Init
    <df9>   DW_AT_decl_file   : 7
    <dfa>   DW_AT_decl_line   : 192
    <dfb>   DW_AT_decl_column : 30
    <dfc>   DW_AT_type        : <0xd3f>
    <e00>   DW_AT_data_member_location: 4
 <2><e01>: Abbrev Number: 1 (DW_TAG_member)
    <e02>   DW_AT_name        : (indirect string, offset: 0x8f43a): pBuffPtr
    <e06>   DW_AT_decl_file   : 7
    <e07>   DW_AT_decl_line   : 194
    <e08>   DW_AT_decl_column : 31
    <e09>   DW_AT_type        : <0xeca>
    <e0d>   DW_AT_data_member_location: 36
 <2><e0e>: Abbrev Number: 1 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x91598): XferSize
    <e13>   DW_AT_decl_file   : 7
    <e14>   DW_AT_decl_line   : 196
    <e15>   DW_AT_decl_column : 30
    <e16>   DW_AT_type        : <0x9b9>
    <e1a>   DW_AT_data_member_location: 40
 <2><e1b>: Abbrev Number: 1 (DW_TAG_member)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x91cde): XferCount
    <e20>   DW_AT_decl_file   : 7
    <e21>   DW_AT_decl_line   : 198
    <e22>   DW_AT_decl_column : 30
    <e23>   DW_AT_type        : <0x9c5>
    <e27>   DW_AT_data_member_location: 42
 <2><e28>: Abbrev Number: 1 (DW_TAG_member)
    <e29>   DW_AT_name        : (indirect string, offset: 0x955b3): XferOptions
    <e2d>   DW_AT_decl_file   : 7
    <e2e>   DW_AT_decl_line   : 200
    <e2f>   DW_AT_decl_column : 30
    <e30>   DW_AT_type        : <0x9d6>
    <e34>   DW_AT_data_member_location: 44
 <2><e35>: Abbrev Number: 1 (DW_TAG_member)
    <e36>   DW_AT_name        : (indirect string, offset: 0x8f756): PreviousState
    <e3a>   DW_AT_decl_file   : 7
    <e3b>   DW_AT_decl_line   : 202
    <e3c>   DW_AT_decl_column : 30
    <e3d>   DW_AT_type        : <0x9d6>
    <e41>   DW_AT_data_member_location: 48
 <2><e42>: Abbrev Number: 1 (DW_TAG_member)
    <e43>   DW_AT_name        : (indirect string, offset: 0x8fb07): hdmatx
    <e47>   DW_AT_decl_file   : 7
    <e48>   DW_AT_decl_line   : 205
    <e49>   DW_AT_decl_column : 31
    <e4a>   DW_AT_type        : <0xecf>
    <e4e>   DW_AT_data_member_location: 52
 <2><e4f>: Abbrev Number: 1 (DW_TAG_member)
    <e50>   DW_AT_name        : (indirect string, offset: 0x8fb00): hdmarx
    <e54>   DW_AT_decl_file   : 7
    <e55>   DW_AT_decl_line   : 207
    <e56>   DW_AT_decl_column : 31
    <e57>   DW_AT_type        : <0xecf>
    <e5b>   DW_AT_data_member_location: 56
 <2><e5c>: Abbrev Number: 1 (DW_TAG_member)
    <e5d>   DW_AT_name        : (indirect string, offset: 0x65097): Lock
    <e61>   DW_AT_decl_file   : 7
    <e62>   DW_AT_decl_line   : 209
    <e63>   DW_AT_decl_column : 30
    <e64>   DW_AT_type        : <0xae5>
    <e68>   DW_AT_data_member_location: 60
 <2><e69>: Abbrev Number: 1 (DW_TAG_member)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x921a1): State
    <e6e>   DW_AT_decl_file   : 7
    <e6f>   DW_AT_decl_line   : 211
    <e70>   DW_AT_decl_column : 30
    <e71>   DW_AT_type        : <0xda5>
    <e75>   DW_AT_data_member_location: 61
 <2><e76>: Abbrev Number: 1 (DW_TAG_member)
    <e77>   DW_AT_name        : (indirect string, offset: 0x95e6b): Mode
    <e7b>   DW_AT_decl_file   : 7
    <e7c>   DW_AT_decl_line   : 213
    <e7d>   DW_AT_decl_column : 30
    <e7e>   DW_AT_type        : <0xdda>
    <e82>   DW_AT_data_member_location: 62
 <2><e83>: Abbrev Number: 1 (DW_TAG_member)
    <e84>   DW_AT_name        : (indirect string, offset: 0x8fb0e): ErrorCode
    <e88>   DW_AT_decl_file   : 7
    <e89>   DW_AT_decl_line   : 215
    <e8a>   DW_AT_decl_column : 30
    <e8b>   DW_AT_type        : <0x9d6>
    <e8f>   DW_AT_data_member_location: 64
 <2><e90>: Abbrev Number: 1 (DW_TAG_member)
    <e91>   DW_AT_name        : (indirect string, offset: 0x8f86f): Devaddress
    <e95>   DW_AT_decl_file   : 7
    <e96>   DW_AT_decl_line   : 217
    <e97>   DW_AT_decl_column : 30
    <e98>   DW_AT_type        : <0x9d6>
    <e9c>   DW_AT_data_member_location: 68
 <2><e9d>: Abbrev Number: 1 (DW_TAG_member)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x8fa58): Memaddress
    <ea2>   DW_AT_decl_file   : 7
    <ea3>   DW_AT_decl_line   : 219
    <ea4>   DW_AT_decl_column : 30
    <ea5>   DW_AT_type        : <0x9d6>
    <ea9>   DW_AT_data_member_location: 72
 <2><eaa>: Abbrev Number: 1 (DW_TAG_member)
    <eab>   DW_AT_name        : (indirect string, offset: 0x8f764): MemaddSize
    <eaf>   DW_AT_decl_file   : 7
    <eb0>   DW_AT_decl_line   : 221
    <eb1>   DW_AT_decl_column : 30
    <eb2>   DW_AT_type        : <0x9d6>
    <eb6>   DW_AT_data_member_location: 76
 <2><eb7>: Abbrev Number: 1 (DW_TAG_member)
    <eb8>   DW_AT_name        : (indirect string, offset: 0x8f8a9): EventCount
    <ebc>   DW_AT_decl_file   : 7
    <ebd>   DW_AT_decl_line   : 223
    <ebe>   DW_AT_decl_column : 30
    <ebf>   DW_AT_type        : <0x9d6>
    <ec3>   DW_AT_data_member_location: 80
 <2><ec4>: Abbrev Number: 0
 <1><ec5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ec6>   DW_AT_byte_size   : 4
    <ec6>   DW_AT_type        : <0xab9>
 <1><eca>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ecb>   DW_AT_byte_size   : 4
    <ecb>   DW_AT_type        : <0x9ad>
 <1><ecf>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ed0>   DW_AT_byte_size   : 4
    <ed0>   DW_AT_type        : <0xcc2>
 <1><ed4>: Abbrev Number: 4 (DW_TAG_typedef)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x8f67b): I2C_HandleTypeDef
    <ed9>   DW_AT_decl_file   : 7
    <eda>   DW_AT_decl_line   : 243
    <edb>   DW_AT_decl_column : 3
    <edc>   DW_AT_type        : <0xddf>
 <1><ee0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ee1>   DW_AT_byte_size   : 4
    <ee1>   DW_AT_type        : <0xee5>
 <1><ee5>: Abbrev Number: 6 (DW_TAG_base_type)
    <ee6>   DW_AT_byte_size   : 1
    <ee7>   DW_AT_encoding    : 8	(unsigned char)
    <ee8>   DW_AT_name        : (indirect string, offset: 0x2db9d): char
 <1><eec>: Abbrev Number: 31 (DW_TAG_const_type)
    <eed>   DW_AT_type        : <0xee5>
 <1><ef1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ef2>   DW_AT_byte_size   : 4
    <ef2>   DW_AT_type        : <0xeec>
 <1><ef6>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x8f866): LCD_LINE
    <efb>   DW_AT_encoding    : 7	(unsigned)
    <efb>   DW_AT_byte_size   : 1
    <efb>   DW_AT_type        : <0x956>
    <eff>   DW_AT_decl_file   : 8
    <eff>   DW_AT_decl_line   : 17
    <f00>   DW_AT_decl_column : 6
    <f00>   DW_AT_sibling     : <0xf1d>
 <2><f04>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f05>   DW_AT_name        : (indirect string, offset: 0x8fae7): LINE1
    <f09>   DW_AT_const_value : 128
 <2><f0a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f0b>   DW_AT_name        : (indirect string, offset: 0x8f7c6): LINE2
    <f0f>   DW_AT_const_value : 192
 <2><f10>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f11>   DW_AT_name        : (indirect string, offset: 0x8faed): LINE3
    <f15>   DW_AT_const_value : 148
 <2><f16>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f17>   DW_AT_name        : (indirect string, offset: 0x8f7cc): LINE4
    <f1b>   DW_AT_const_value : 212
 <2><f1c>: Abbrev Number: 0
 <1><f1d>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x8f40e): LCD_POS
    <f22>   DW_AT_encoding    : 7	(unsigned)
    <f22>   DW_AT_byte_size   : 1
    <f22>   DW_AT_type        : <0x956>
    <f26>   DW_AT_decl_file   : 8
    <f26>   DW_AT_decl_line   : 25
    <f27>   DW_AT_decl_column : 6
    <f27>   DW_AT_sibling     : <0xfaa>
 <2><f2b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x8f54a): POS0
    <f30>   DW_AT_const_value : 0
 <2><f31>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f32>   DW_AT_name        : (indirect string, offset: 0xedd2): POS1
    <f36>   DW_AT_const_value : 1
 <2><f37>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f38>   DW_AT_name        : (indirect string, offset: 0x82048): POS2
    <f3c>   DW_AT_const_value : 2
 <2><f3d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x8f54f): POS3
    <f42>   DW_AT_const_value : 3
 <2><f43>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0x8f790): POS4
    <f48>   DW_AT_const_value : 4
 <2><f49>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x8f554): POS5
    <f4e>   DW_AT_const_value : 5
 <2><f4f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0x8f559): POS6
    <f54>   DW_AT_const_value : 6
 <2><f55>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0x8f55e): POS7
    <f5a>   DW_AT_const_value : 7
 <2><f5b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x8f795): POS8
    <f60>   DW_AT_const_value : 8
 <2><f61>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f62>   DW_AT_name        : (indirect string, offset: 0x8f79a): POS9
    <f66>   DW_AT_const_value : 9
 <2><f67>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f68>   DW_AT_name        : (indirect string, offset: 0x8fb26): POS10
    <f6c>   DW_AT_const_value : 10
 <2><f6d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f6e>   DW_AT_name        : (indirect string, offset: 0x8fb2c): POS11
    <f72>   DW_AT_const_value : 11
 <2><f73>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f74>   DW_AT_name        : (indirect string, offset: 0x8fb32): POS12
    <f78>   DW_AT_const_value : 12
 <2><f79>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x8fb38): POS13
    <f7e>   DW_AT_const_value : 13
 <2><f7f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f80>   DW_AT_name        : (indirect string, offset: 0x8fb3e): POS14
    <f84>   DW_AT_const_value : 14
 <2><f85>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f86>   DW_AT_name        : (indirect string, offset: 0x8f8c7): POS15
    <f8a>   DW_AT_const_value : 15
 <2><f8b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x8fb44): POS16
    <f90>   DW_AT_const_value : 16
 <2><f91>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f92>   DW_AT_name        : (indirect string, offset: 0x8fb4a): POS17
    <f96>   DW_AT_const_value : 17
 <2><f97>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f98>   DW_AT_name        : (indirect string, offset: 0x8fb50): POS18
    <f9c>   DW_AT_const_value : 18
 <2><f9d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x8fb56): POS19
    <fa2>   DW_AT_const_value : 19
 <2><fa3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fa4>   DW_AT_name        : (indirect string, offset: 0x8fb72): POS20
    <fa8>   DW_AT_const_value : 20
 <2><fa9>: Abbrev Number: 0
 <1><faa>: Abbrev Number: 20 (DW_TAG_structure_type)
    <fab>   DW_AT_name        : (indirect string, offset: 0x8fa17): SimpleMenu
    <faf>   DW_AT_byte_size   : 20
    <fb0>   DW_AT_decl_file   : 9
    <fb1>   DW_AT_decl_line   : 12
    <fb2>   DW_AT_decl_column : 16
    <fb2>   DW_AT_sibling     : <0xff8>
 <2><fb6>: Abbrev Number: 1 (DW_TAG_member)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x8fa41): title
    <fbb>   DW_AT_decl_file   : 9
    <fbc>   DW_AT_decl_line   : 14
    <fbd>   DW_AT_decl_column : 17
    <fbe>   DW_AT_type        : <0xef1>
    <fc2>   DW_AT_data_member_location: 0
 <2><fc3>: Abbrev Number: 1 (DW_TAG_member)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x8f6d4): items
    <fc8>   DW_AT_decl_file   : 9
    <fc9>   DW_AT_decl_line   : 15
    <fca>   DW_AT_decl_column : 18
    <fcb>   DW_AT_type        : <0xff8>
    <fcf>   DW_AT_data_member_location: 4
 <2><fd0>: Abbrev Number: 1 (DW_TAG_member)
    <fd1>   DW_AT_name        : (indirect string, offset: 0x8fa36): item_count
    <fd5>   DW_AT_decl_file   : 9
    <fd6>   DW_AT_decl_line   : 16
    <fd7>   DW_AT_decl_column : 13
    <fd8>   DW_AT_type        : <0x9ad>
    <fdc>   DW_AT_data_member_location: 8
 <2><fdd>: Abbrev Number: 1 (DW_TAG_member)
    <fde>   DW_AT_name        : (indirect string, offset: 0x8f8dd): select_callback
    <fe2>   DW_AT_decl_file   : 9
    <fe3>   DW_AT_decl_line   : 17
    <fe4>   DW_AT_decl_column : 12
    <fe5>   DW_AT_type        : <0x1012>
    <fe9>   DW_AT_data_member_location: 12
 <2><fea>: Abbrev Number: 1 (DW_TAG_member)
    <feb>   DW_AT_name        : (indirect string, offset: 0x8f725): back_link
    <fef>   DW_AT_decl_file   : 9
    <ff0>   DW_AT_decl_line   : 18
    <ff1>   DW_AT_decl_column : 24
    <ff2>   DW_AT_type        : <0x1017>
    <ff6>   DW_AT_data_member_location: 16
 <2><ff7>: Abbrev Number: 0
 <1><ff8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ff9>   DW_AT_byte_size   : 4
    <ff9>   DW_AT_type        : <0xef1>
 <1><ffd>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <ffe>   DW_AT_prototyped  : 1
    <ffe>   DW_AT_sibling     : <0x100d>
 <2><1002>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1003>   DW_AT_type        : <0x100d>
 <2><1007>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1008>   DW_AT_type        : <0x9ad>
 <2><100c>: Abbrev Number: 0
 <1><100d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <100e>   DW_AT_byte_size   : 4
    <100e>   DW_AT_type        : <0xed4>
 <1><1012>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1013>   DW_AT_byte_size   : 4
    <1013>   DW_AT_type        : <0xffd>
 <1><1017>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1018>   DW_AT_byte_size   : 4
    <1018>   DW_AT_type        : <0xfaa>
 <1><101c>: Abbrev Number: 4 (DW_TAG_typedef)
    <101d>   DW_AT_name        : (indirect string, offset: 0x8fa17): SimpleMenu
    <1021>   DW_AT_decl_file   : 9
    <1022>   DW_AT_decl_line   : 19
    <1023>   DW_AT_decl_column : 3
    <1024>   DW_AT_type        : <0xfaa>
 <1><1028>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1029>   DW_AT_byte_size   : 8
    <102a>   DW_AT_decl_file   : 9
    <102b>   DW_AT_decl_line   : 21
    <102c>   DW_AT_decl_column : 9
    <102c>   DW_AT_sibling     : <0x104b>
 <2><1030>: Abbrev Number: 1 (DW_TAG_member)
    <1031>   DW_AT_name        : (indirect string, offset: 0x8f3db): Longtitude
    <1035>   DW_AT_decl_file   : 9
    <1036>   DW_AT_decl_line   : 23
    <1037>   DW_AT_decl_column : 11
    <1038>   DW_AT_type        : <0x104b>
    <103c>   DW_AT_data_member_location: 0
 <2><103d>: Abbrev Number: 1 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0x8f4de): Lattitude
    <1042>   DW_AT_decl_file   : 9
    <1043>   DW_AT_decl_line   : 24
    <1044>   DW_AT_decl_column : 11
    <1045>   DW_AT_type        : <0x104b>
    <1049>   DW_AT_data_member_location: 4
 <2><104a>: Abbrev Number: 0
 <1><104b>: Abbrev Number: 6 (DW_TAG_base_type)
    <104c>   DW_AT_byte_size   : 4
    <104d>   DW_AT_encoding    : 4	(float)
    <104e>   DW_AT_name        : (indirect string, offset: 0x7a68b): float
 <1><1052>: Abbrev Number: 4 (DW_TAG_typedef)
    <1053>   DW_AT_name        : (indirect string, offset: 0x8f7d8): gpsSettingsValue
    <1057>   DW_AT_decl_file   : 9
    <1058>   DW_AT_decl_line   : 25
    <1059>   DW_AT_decl_column : 3
    <105a>   DW_AT_type        : <0x1028>
 <1><105e>: Abbrev Number: 8 (DW_TAG_variable)
    <105f>   DW_AT_name        : (indirect string, offset: 0x8f87a): mainMenu
    <1063>   DW_AT_decl_file   : 9
    <1063>   DW_AT_decl_line   : 27
    <1064>   DW_AT_decl_column : 19
    <1065>   DW_AT_type        : <0x101c>
    <1069>   DW_AT_external    : 1
    <1069>   DW_AT_declaration : 1
 <1><1069>: Abbrev Number: 8 (DW_TAG_variable)
    <106a>   DW_AT_name        : (indirect string, offset: 0x8f9a9): menuMenu
    <106e>   DW_AT_decl_file   : 9
    <106e>   DW_AT_decl_line   : 28
    <106f>   DW_AT_decl_column : 19
    <1070>   DW_AT_type        : <0x101c>
    <1074>   DW_AT_external    : 1
    <1074>   DW_AT_declaration : 1
 <1><1074>: Abbrev Number: 8 (DW_TAG_variable)
    <1075>   DW_AT_name        : (indirect string, offset: 0x8f453): settingsMenu
    <1079>   DW_AT_decl_file   : 9
    <1079>   DW_AT_decl_line   : 29
    <107a>   DW_AT_decl_column : 19
    <107b>   DW_AT_type        : <0x101c>
    <107f>   DW_AT_external    : 1
    <107f>   DW_AT_declaration : 1
 <1><107f>: Abbrev Number: 8 (DW_TAG_variable)
    <1080>   DW_AT_name        : (indirect string, offset: 0x8f9d6): buzzerMenu
    <1084>   DW_AT_decl_file   : 9
    <1084>   DW_AT_decl_line   : 30
    <1085>   DW_AT_decl_column : 19
    <1086>   DW_AT_type        : <0x101c>
    <108a>   DW_AT_external    : 1
    <108a>   DW_AT_declaration : 1
 <1><108a>: Abbrev Number: 18 (DW_TAG_array_type)
    <108b>   DW_AT_type        : <0xef1>
    <108f>   DW_AT_sibling     : <0x1095>
 <2><1093>: Abbrev Number: 32 (DW_TAG_subrange_type)
 <2><1094>: Abbrev Number: 0
 <1><1095>: Abbrev Number: 8 (DW_TAG_variable)
    <1096>   DW_AT_name        : (indirect string, offset: 0x8f3fa): mainMenuItems
    <109a>   DW_AT_decl_file   : 9
    <109a>   DW_AT_decl_line   : 34
